MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_smartcard.c
  * @brief   SMARTCARD HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the SMARTCARD peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Error functions.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined(USART1) || defined(USART2) || defined(USART3) || defined(UART4) || defined(UART5) || defined(USART6) \
 || defined(UART7)
#if defined(USE_HAL_SMARTCARD_MODULE) && (USE_HAL_SMARTCARD_MODULE == 1)
/** @addtogroup SMARTCARD SMARTCARD
  * @{
  */
/** @defgroup SMARTCARD_Introduction SMARTCARD Introduction
  * @{

  - The SMARTCARD hardware abstraction layer provides a set of APIs to interface with the STM32 **USART** (Universal
    Synchronous/Asynchronous Receiver Transmitter) peripheral to support the T = 0 and T = 1 asynchronous protocols
    for smartcards as defined in the ISO/IEC 7816-3 standard.

  - It simplifies the configuration, initialization, and management of SMARTCARD communication by supporting
    various modes such as polling, interrupt, and DMA for efficient data transfer.

  - This abstraction layer ensures portability and ease of use across different STM32 series.

  */
/**
  * @}
  */

/** @defgroup SMARTCARD_How_To_Use SMARTCARD How To Use
  * @{

# How to use the SMARTCARD HAL module driver

The SMARTCARD HAL driver can be used as follows:

1. Declare a hal_smartcard_handle_t handle structure, for example:
   hal_smartcard_handle_t hsmartcard;

2. Initialize the SMARTCARDx driver with a USART HW instance by calling the HAL_SMARTCARD_Init().
   The SMARTCARDx clock is enabled inside the HAL_SMARTCARD_Init() if USE_HAL_SMARTCARD_CLK_ENABLE_MODEL >
   HAL_CLK_ENABLE_NO.

3. Configure the low-level hardware (GPIO, CLOCK, NVIC, etc.):
    - Enable the SMARTCARDx interface clock when USE_HAL_SMARTCARD_CLK_ENABLE_MODEL is set to HAL_CLK_ENABLE_NO.
    - Configure SMARTCARDx pins:
        - Enable the clock for the SMARTCARDx GPIOs
        - Configure SMARTCARDx pins as alternate-function open-drain
    - Configure the NVIC for interrupt processing:
        - Configure the SMARTCARDx interrupt priority
        - Enable the NVIC SMARTCARDx IRQ Channel

4. Configure the communication baud rate, stop bit, first bit, parity mode, NACK, smartcard clock prescaler,
   source clock prescaler, clock polarity, clock phase, clock output enabling, guard time and auto retry count by
   calling HAL_SMARTCARD_SetConfig().

  @note In SMARTCARD mode, ETU (Elementary Time Unit) is equivalent to the baud period duration

  Configure or enable advanced features:
    - HAL_SMARTCARD_EnableIOInvert() to invert the IO pin active level logic
    - HAL_SMARTCARD_EnableDataInvert() to invert the binary data logic
    - HAL_SMARTCARD_EnableTxRxSwap() to change the GPIO used (USART Tx by default)
    - HAL_SMARTCARD_EnableRxOverRunDetection() to detect Rx Overrun errors
    - HAL_SMARTCARD_EnableDMAStopOnRxError() to stop DMA on Rx error
    - HAL_SMARTCARD_SetReceiverTimeout() to set the Rx timeout value
    - HAL_SMARTCARD_EnableReceiverTimeout() to detect Rx timeout
    - HAL_SMARTCARD_SetTxCpltIndication() to change the Tx complete indication
    - HAL_SMARTCARD_EnableFifoMode() to change the FIFO mode status
    - HAL_SMARTCARD_SetTxFifoThreshold() to set the Tx FIFO threshold
    - HAL_SMARTCARD_SetRxFifoThreshold() to set the Rx FIFO threshold
    - HAL_SMARTCARD_SetBlockLength() to set the block length (in bytes)

  All these advanced configurations are optional. If not called, default values apply.

5. For SMARTCARDx I/O operations, polling, interrupt, and DMA are available in this driver.

  - Polling-mode I/O operation
    - Send an amount of data in blocking mode using HAL_SMARTCARD_Transmit()
    - Receive an amount of data in blocking mode using HAL_SMARTCARD_Receive()
    - The communication is performed in polling mode. The HAL status of all data processing is returned by the same
      function after finishing transfer.

  - Interrupt-mode I/O operation
    - Send an amount of data in non-blocking mode using HAL_SMARTCARD_Transmit_IT()
    - At the end of transmission, execute HAL_SMARTCARD_TxCpltCallback().
      Customize the associated function pointer to add application-specific code.
    - Receive an amount of data in non-blocking mode using HAL_SMARTCARD_Receive_IT()
    - At the end of reception, execute HAL_SMARTCARD_RxCpltCallback().
      Customize the associated function pointer to add application-specific code.
    - On transfer error, execute HAL_SMARTCARD_ErrorCallback().
      Customize the associated function pointer to add application-specific code.

  - DMA-mode I/O operation
    - Send an amount of data in non-blocking mode (DMA) using HAL_SMARTCARD_Transmit_DMA()
    - At the half-transfer point, execute HAL_SMARTCARD_TxHalfCpltCallback().
      Customize the associated function pointer to add application-specific code.
    - At the end of transmission, execute HAL_SMARTCARD_TxCpltCallback().
      Customize the associated function pointer to add application-specific code.
    - Receive an amount of data in non-blocking mode (DMA) using HAL_SMARTCARD_Receive_DMA()
    - At the half-transfer point, execute HAL_SMARTCARD_RxHalfCpltCallback().
      Customize the associated function pointer to add application-specific code.
    - At the end of reception, execute HAL_SMARTCARD_RxCpltCallback().
      Customize the associated function pointer to add application-specific code.
    - On transfer error, execute HAL_SMARTCARD_ErrorCallback().
      Customize the associated function pointer to add application-specific code.

  - The following sequential SMARTCARD interfaces are available:
    - Abort a polling SMARTCARD communication process using HAL_SMARTCARD_Abort().
    - Abort an IT SMARTCARD communication process using interrupts with HAL_SMARTCARD_Abort_IT().
    - At the end of the abort IT process, execute HAL_SMARTCARD_AbortCpltCallback().
      Customize the associated function pointer to add application-specific code.

