MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
6. Callback registration
  - When the compilation flag USE_HAL_SMARTCARD_REGISTER_CALLBACKS is set to 1, it allows the user to configure
    the driver callbacks dynamically via its own method:

    Callback name             | Default value                       | Callback registration function
  ----------------------------| ----------------------------------- | ---------------------------
  TxHalfCpltCallback          | HAL_SMARTCARD_TxHalfCpltCallback()  | HAL_SMARTCARD_RegisterTxHalfCpltCallback()
  TxCpltCallback              | HAL_SMARTCARD_TxCpltCallback()      | HAL_SMARTCARD_RegisterTxCpltCallback()
  RxHalfCpltCallback          | HAL_SMARTCARD_RxHalfCpltCallback()  | HAL_SMARTCARD_RegisterRxHalfCpltCallback()
  RxCpltCallback              | HAL_SMARTCARD_RxCpltCallback()      | HAL_SMARTCARD_RegisterRxCpltCallback()
  ErrorCallback               | HAL_SMARTCARD_ErrorCallback()       | HAL_SMARTCARD_RegisterErrorCallback()
  AbortCpltCallback           | HAL_SMARTCARD_AbortCpltCallback()   | HAL_SMARTCARD_RegisterAbortCpltCallback()
  RxFifoFullCallback          | HAL_SMARTCARD_RxFifoFullCallback()  | HAL_SMARTCARD_RegisterRxFifoFullCallback()
  TxFifoEmptyCallback         | HAL_SMARTCARD_TxFifoEmptyCallback() | HAL_SMARTCARD_RegisterTxFifoEmptyCallback()

  - To unregister a callback, register the default callback via the registration function.

  - By default, after the HAL_SMARTCARD_Init() and when the state is HAL_SMARTCARD_STATE_INIT, all callbacks are set to
    the corresponding default weak functions.

  - Callbacks can be registered in the handle global_state HAL_SMARTCARD_STATE_INIT and HAL_SMARTCARD_STATE_CONFIGURED.

  - When the compilation flag USE_HAL_SMARTCARD_REGISTER_CALLBACKS is set to 0 or not defined, the callback registration
    feature is not available and all callbacks are set to the corresponding weak functions.

7. Acquire/Release the HAL SMARTCARD handle
  - When the compilation flag USE_HAL_MUTEX is set to 1, a multi-threaded user application is allowed to acquire the
    SMARTCARD HAL handle to execute a transmit or receive process, or a sequence of transmit/receive operations.
    Release the SMARTCARD HAL handle when the process or sequence ends.
  - HAL acquire/release operations are based on the HAL OS abstraction layer (stm32_hal_os.c/.h osal):
     - HAL_SMARTCARD_AcquireBus() allows acquiring the HAL SMARTCARD handle.
     - HAL_SMARTCARD_ReleaseBus() allows releasing the HAL SMARTCARD handle.

  - When the compilation flag USE_HAL_MUTEX is set to 0 or not defined, HAL_SMARTCARD_AcquireBus() and
    HAL_SMARTCARD_ReleaseBus() are not available.
  */
/**
  * @}
  */

/** @defgroup SMARTCARD_Configuration_Table SMARTCARD Configuration Table
  * @{
## Configuration inside the SMARTCARD driver

Software configuration defined in stm32c5xx_hal_conf.h:
Preprocessor flags                   |   Default value   | Comment
------------------------------------ | ----------------- | ------------------------------------------------
USE_HAL_SMARTCARD_MODULE             |         1         | Enable HAL SMARTCARD driver module
USE_HAL_SMARTCARD_REGISTER_CALLBACKS |         0         | Allow the user to define their own callback
USE_HAL_SMARTCARD_DMA                |         1         | Enable DMA code inside SMARTCARD
USE_HAL_CHECK_PARAM                  |         0         | Enable runtime parameter checks
USE_HAL_SMARTCARD_CLK_ENABLE_MODEL   | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_CHECK_PROCESS_STATE          |         0         | Enable atomicity of process state checks
USE_HAL_MUTEX                        |         0         | Enable semaphore creation for OS
USE_HAL_SMARTCARD_USER_DATA          |         0         | Add user data inside the HAL SMARTCARD handle
USE_HAL_SMARTCARD_GET_LAST_ERRORS    |         0         | Enable retrieval of last process error codes
USE_HAL_SMARTCARD_FIFO               |         1         | Enable the FIFO feature

Software configuration defined in preprocessor environment:
Preprocessor flags                   |   Default value   | Comment
------------------------------------ | ----------------- | ------------------------------------------------
USE_ASSERT_DBG_PARAM                 |    Not defined    | Enable parameter checks for HAL and LL
USE_ASSERT_DBG_STATE                 |    Not defined    | Enable state checks for HAL

  */
/**
  * @}
  */
/* Private define ------------------------------------------------------------*/
/** @defgroup SMARTCARD_Private_Constants SMARTCARD Private Constants
  * @{
  */
#define USART_BRR_MIN 0x10U         /*!< USART BRR minimum authorized value */

#define USART_BRR_MAX 0xFFFFU       /*!< USART BRR maximum authorized value */

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
#define RX_FIFO_DEPTH 8U           /*!< SMARTCARD RX FIFO depth */

#define TX_FIFO_DEPTH 8U           /*!< SMARTCARD TX FIFO depth */
#endif /* USE_HAL_SMARTCARD_FIFO */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup SMARTCARD_Private_Macros SMARTCARD Private Macros
  * @{
  */

/** @brief  Check SMARTCARD baud rate.
  * @param  baud_rate baud rate specified by the user.
  *         The maximum baud rate is derived from the maximum clock on C5 (144 MHz)
  *         divided by the oversampling method used on the USART (that is, 16)
  * @retval 1U (baud_rate is valid) or 0U (baud_rate is invalid)
  */
#define IS_SMARTCARD_BAUD_RATE(baud_rate) ((baud_rate) <= 9000000U && ((baud_rate) != 0U))

/** @brief  Check SMARTCARD Receiver Timeout value.
  * @param  timeout_etu Timeout value.
  * @retval 1U (timeout_etu is valid) or 0U (timeout_etu is invalid)
  */
#define IS_SMARTCARD_TIMEOUT_VALUE(timeout_etu) ((timeout_etu) <= 0xFFFFFFU)

/**
  * @brief Ensure that SMARTCARD frame number of stop bits is valid.
  * @param stopbits SMARTCARD frame number of stop bits.
  * @retval 1U (stopbits is valid) or 0U (stopbits is invalid)
  */
#define IS_SMARTCARD_STOP_BITS(stopbits) (((stopbits) == HAL_SMARTCARD_STOP_BIT_0_5) \
                                          || ((stopbits) == HAL_SMARTCARD_STOP_BIT_1_5))

/**
  * @brief Ensure that SMARTCARD first bit sent (MSB or LSB) is valid.
  * @param first_bit SMARTCARD first bit sent (MSB or LSB) parameter.
  * @retval 1U (first_bit is valid) or 0U (first_bit is invalid)
  */
#define IS_SMARTCARD_FIRST_BIT(first_bit) (((first_bit) == HAL_SMARTCARD_BIT_ORDER_LSB_FIRST) \
                                           || ((first_bit) == HAL_SMARTCARD_BIT_ORDER_MSB_FIRST))

/**
  * @brief Ensure that SMARTCARD nack management setting is valid.
  * @param nack SMARTCARD nack management setting.
  * @retval 1U (nack is valid) or 0U (nack is invalid)
  */
#define IS_SMARTCARD_NACK(nack) (((nack) == HAL_SMARTCARD_NACK_DISABLE) \
                                 || ((nack) == HAL_SMARTCARD_NACK_ENABLE))

/**
  * @brief Ensure that SMARTCARD clock output is valid.
  * @param clockoutput SMARTCARD clock output.
  * @retval 1U (clockoutput is valid) or 0U (clockoutput is invalid)
  */
#define IS_SMARTCARD_CLOCK_OUTPUT(clockoutput) (((clockoutput) == HAL_SMARTCARD_CLOCK_OUTPUT_ENABLE) \
                                                || ((clockoutput) == HAL_SMARTCARD_CLOCK_OUTPUT_DISABLE))

/**
  * @brief Ensure that SMARTCARD clock polarity is valid.
  * @param polarity SMARTCARD clock polarity.
  * @retval 1U (polarity is valid) or 0U (polarity is invalid)
  */
#define IS_SMARTCARD_CLOCK_POLARITY(polarity) (((polarity) == HAL_SMARTCARD_CLOCK_POLARITY_HIGH) \
                                               || ((polarity) == HAL_SMARTCARD_CLOCK_POLARITY_LOW))

/**
  * @brief Ensure that SMARTCARD clock phase is valid.
  * @param clock_phase SMARTCARD clock phase.
  * @retval 1U (clock_phase is valid) or 0U (clock_phase is invalid)
  */
#define IS_SMARTCARD_CLOCK_PHASE(clock_phase) (((clock_phase) == HAL_SMARTCARD_CLOCK_PHASE_1_EDGE) \
                                               || ((clock_phase) == HAL_SMARTCARD_CLOCK_PHASE_2_EDGE))

/**
  * @brief Ensure that SMARTCARD frame parity is valid.
  * @param parity SMARTCARD frame parity.
  * @retval 1U (parity is valid) or 0U (parity is invalid)
  */
#define IS_SMARTCARD_PARITY(parity) (((parity) == HAL_SMARTCARD_PARITY_EVEN) \
                                     || ((parity) == HAL_SMARTCARD_PARITY_ODD))

/**
  * @brief Ensure that SMARTCARD retry count is valid.
  * @param retry_count SMARTCARD retry count.
  * @retval 1U (retry count is valid) or 0U (retry count is invalid)
  */
#define IS_SMARTCARD_RETRY_COUNT(retry_count) (((retry_count) <= 7UL))

/**
  * @brief Ensure that SMARTCARD guard time is valid.
  * @param guard_time_etu SMARTCARD guard time (Elementary Time Unit).
  * @retval 1U (guard time is valid) or 0U (guard time is invalid)
  */
#define IS_SMARTCARD_GUARD_TIME(guard_time_etu) ((guard_time_etu) <= 0xFFU)

/**
  * @brief Ensure that SMARTCARD Tx complete indication is valid.
  * @param indication SMARTCARD frame Tx complete indication.
  * @retval 1U (indication is valid) or 0U (indication is invalid)
  */
#define IS_SMARTCARD_TX_CPLT(indication) (((indication) == HAL_SMARTCARD_TX_CPLT_BEFORE_GUARD_TIME) \
                                          || ((indication) == HAL_SMARTCARD_TX_CPLT_AFTER_GUARD_TIME))

/**
  * @brief Ensure that SMARTCARD Prescaler is valid.
  * @param clock_prescaler SMARTCARD Prescaler value.
  * @retval 1U (clock_prescaler is valid) or 0U (clock_prescaler is invalid)
  */
#define IS_SMARTCARD_CLOCK_PRESCALER(clock_prescaler) ((clock_prescaler) <= HAL_SMARTCARD_CLOCK_PRESC_DIV256)

/**
  * @brief Ensure that SMARTCARD block length is valid.
  * @param block_length_byte SMARTCARD block length value.
  * @retval 1U (block_length_byte is valid) or 0U (block_length_byte is invalid)
  */
#define IS_SMARTCARD_BLOCK_LENGTH(block_length_byte) ((block_length_byte) <= 0xFFUL)

/**
  * @brief Ensure that SMARTCARD clock Prescaler is valid.
  * @param sclk_prescaler SMARTCARD Prescaler value.
  * @retval 1U (sclk_prescaler is valid) or 0U (sclk_prescaler is invalid)
  */
#define IS_SMARTCARD_SCLK_PRESCALER(sclk_prescaler) (((sclk_prescaler) >= HAL_SMARTCARD_SCLK_PRESC_DIV2)       \
                                                     && ((sclk_prescaler) <= HAL_SMARTCARD_SCLK_PRESC_DIV62))

