MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)

/**
  * @brief Ensure that SMARTCARD FIFO threshold level is valid.
  * @param threshold SMARTCARD FIFO threshold level.
  * @retval 1U (threshold is valid) or 0U (threshold is invalid)
  */
#define IS_SMARTCARD_FIFO_THRESHOLD(threshold) (((threshold) == HAL_SMARTCARD_FIFO_THRESHOLD_1_8)         \
                                                || ((threshold) == HAL_SMARTCARD_FIFO_THRESHOLD_1_4)      \
                                                || ((threshold) == HAL_SMARTCARD_FIFO_THRESHOLD_1_2)      \
                                                || ((threshold) == HAL_SMARTCARD_FIFO_THRESHOLD_3_4)      \
                                                || ((threshold) == HAL_SMARTCARD_FIFO_THRESHOLD_7_8)      \
                                                || ((threshold) == HAL_SMARTCARD_FIFO_THRESHOLD_8_8))

/**
  * @brief Ensure that SMARTCARD Optional Interrupts for IT in Transmit is valid.
  * @param interrupt SMARTCARD Optional Interrupts.
  * @retval 1U (interrupt is valid) or 0U (interrupt is invalid)
  */

#define IS_SMARTCARD_OPT_TX_IT(interrupt)  (((interrupt) == HAL_SMARTCARD_OPT_TX_IT_NONE)                 \
                                            || ((interrupt) == HAL_SMARTCARD_OPT_TX_IT_FIFO_EMPTY)        \
                                            || ((interrupt) == HAL_SMARTCARD_OPT_TX_IT_DEFAULT))

/**
  * @brief Ensure that SMARTCARD Optional Interrupts for IT in Receive is valid.
  * @param interrupt SMARTCARD Optional Interrupts.
  * @retval 1U (interrupt is valid) or 0U (interrupt is invalid)
  */
#define IS_SMARTCARD_OPT_RX_IT(interrupt)    (((interrupt) == HAL_SMARTCARD_OPT_RX_IT_NONE)               \
                                              || ((interrupt) == HAL_SMARTCARD_OPT_RX_IT_FIFO_FULL)       \
                                              || ((interrupt) == HAL_SMARTCARD_OPT_RX_IT_DEFAULT))
#endif /* USE_HAL_SMARTCARD_FIFO */

#if defined (USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
/**
  * @brief Ensure that SMARTCARD Optional Interrupts for DMA in Receive is valid.
  * @param interrupt SMARTCARD Optional Interrupts.
  * @retval 1U (interrupt is valid) or 0U (interrupt is invalid)
  */

#define IS_SMARTCARD_OPT_RX_DMA(interrupt)    (((interrupt) == HAL_SMARTCARD_OPT_DMA_RX_IT_NONE)          \
                                               || ((interrupt) == HAL_SMARTCARD_OPT_DMA_RX_IT_HT)         \
                                               || ((interrupt) == HAL_SMARTCARD_OPT_DMA_RX_IT_DEFAULT))

/**
  * @brief Ensure that SMARTCARD Optional Interrupts for DMA in Transmit is valid.
  * @param interrupt SMARTCARD Optional Interrupts.
  * @retval 1U (interrupt is valid) or 0U (interrupt is invalid)
  */

#define IS_SMARTCARD_OPT_TX_DMA(interrupt)  (((interrupt) == HAL_SMARTCARD_OPT_DMA_TX_IT_NONE)            \
                                             || ((interrupt) == HAL_SMARTCARD_OPT_DMA_TX_IT_HT)           \
                                             || ((interrupt) == HAL_SMARTCARD_OPT_DMA_TX_IT_DEFAULT))

#endif /* USE_HAL_SMARTCARD_DMA */
/**
  * @brief Check if USART instance is enabled. If yes, disable it.
  * @param handle specifies the USART Handle
  */
#define SMARTCARD_ENSURE_INSTANCE_DISABLED(handle)           \
  uint32_t instance_enabled;                                 \
  do                                                         \
  {                                                          \
    instance_enabled = LL_USART_IsEnabled(handle);           \
    if (instance_enabled != 0U)                              \
    {                                                        \
      LL_USART_Disable(handle);                              \
    }                                                        \
  }  while(0U)

/**
  * @brief Check if USART instance needs to be re-enabled.
  * @param handle specifies the USART Handle
  */
#define SMARTCARD_ENSURE_INSTANCE_ENABLED(handle)            \
  do                                                         \
  {                                                          \
    if (instance_enabled != 0U)                              \
    {                                                        \
      LL_USART_Enable(handle);                               \
    }                                                        \
  }  while(0U)

/** @brief  Return the transmission completion flag.
  * @param  handle specifies the SMARTCARD Handle.
  * @note   Based on tx_cplt_indication setting, return TC or TCBGT flag.
  *         When TCBGT flag (Transmission Complete Before Guard Time) is not available, TC flag is
  *         reported.
  * @retval Transmission completion flag
  */
#define SMARTCARD_TRANSMISSION_COMPLETION_FLAG(handle) \
  (((handle)->tx_cplt_indication == HAL_SMARTCARD_TX_CPLT_AFTER_GUARD_TIME) ? (LL_USART_ISR_TC) : (LL_USART_ISR_TCBGT))

/**
  * @brief Retrieve SMARTCARD instance from handle.
  * @param handle specifies the USART Handle
  */
#define SMARTCARD_GET_INSTANCE(handle)   ((USART_TypeDef *)((uint32_t)(handle)->instance))

/**
  * @}
  */
/* Private function prototypes -----------------------------------------------*/
/** @defgroup SMARTCARD_Private_Functions SMARTCARD Private Functions
  * @{
  */
static void SMARTCARD_Abort(hal_smartcard_handle_t *hsmartcard);
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
static void SMARTCARD_InitCallbacksToDefault(hal_smartcard_handle_t *hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
static hal_status_t SMARTCARD_WaitOnFlagUntilTimeout(hal_smartcard_handle_t *hsmartcard, uint32_t flag,
                                                     uint32_t status, uint32_t tickstart, uint32_t timeout_ms);
static void SMARTCARD_EndTxTransfer(hal_smartcard_handle_t *hsmartcard);
static void SMARTCARD_EndRxTransfer(hal_smartcard_handle_t *hsmartcard);
hal_status_t SMARTCARD_Start_Transmit_IT(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data, uint32_t size,
                                         uint32_t interrupts);
hal_status_t SMARTCARD_Start_Receive_IT(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data, uint32_t size,
                                        uint32_t interrupts);
#if defined (USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
hal_status_t SMARTCARD_Start_Transmit_DMA(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data, uint32_t size,
                                          uint32_t interrupts);
hal_status_t SMARTCARD_Start_Receive_DMA(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data, uint32_t size,
                                         uint32_t interrupts);
static void SMARTCARD_DMATxHalfCplt(hal_dma_handle_t *hdma);
static void SMARTCARD_DMATransmitCplt(hal_dma_handle_t *hdma);
static void SMARTCARD_DMARxHalfCplt(hal_dma_handle_t *hdma);
static void SMARTCARD_DMAReceiveCplt(hal_dma_handle_t *hdma);
static void SMARTCARD_DMAError(hal_dma_handle_t *hdma);
static void SMARTCARD_DMAAbortOnError(hal_dma_handle_t *hdma);
static void SMARTCARD_DMATxAbortCallback(hal_dma_handle_t *hdma);
static void SMARTCARD_DMARxAbortCallback(hal_dma_handle_t *hdma);
#endif /* USE_HAL_SMARTCARD_DMA */
static void SMARTCARD_TxISR(hal_smartcard_handle_t *hsmartcard);
static void SMARTCARD_EndTransmit_IT(hal_smartcard_handle_t *hsmartcard);
static void SMARTCARD_RxISR(hal_smartcard_handle_t *hsmartcard);
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
static void SMARTCARD_TxISR_FIFOEN(hal_smartcard_handle_t *hsmartcard);
static void SMARTCARD_RxISR_FIFOEN(hal_smartcard_handle_t *hsmartcard);
#endif /* USE_HAL_SMARTCARD_FIFO */
#if defined(USE_HAL_SMARTCARD_CLK_ENABLE_MODEL) && (USE_HAL_SMARTCARD_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
static void SMARTCARD_EnableClock(const hal_smartcard_handle_t *hsmartcard);
#endif /* USE_HAL_SMARTCARD_CLK_ENABLE_MODEL */

static void SMARTCARD_FLUSH_DRREGISTER(hal_smartcard_handle_t *hsmartcard);
#if defined(USE_ASSERT_DBG_PARAM)
hal_status_t SMARTCARD_Check_uart_baudrate_validity(uint32_t instance_clock_freq, uint32_t instance_clock_prescaler,
                                                    uint32_t baud_rate);
#endif /* USE_ASSERT_DBG_PARAM */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

