MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
/** @addtogroup SMARTCARD_Exported_Functions
  * @{
  */

/** @addtogroup SMARTCARD_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  This subsection provides a set of functions allowing to initialize and de-initialize the USARTx peripheral:
  - Call the function HAL_SMARTCARD_Init() to initialize the selected HAL_SMARTCARD handle and associate an instance.
  - Call the function HAL_SMARTCARD_DeInit() to restore the default initialization of the selected USARTx peripheral.
  */

/**
  * @brief Initialize the SMARTCARD according to the associated handle.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *               the configuration information for SMARTCARD module.
  * @param  instance SMARTCARD instance.
  * @retval HAL_INVALID_PARAM When the handle is NULL.
  * @retval HAL_ERROR When the MUTEX cannot be created.
  * @retval HAL_OK HAL SMARTCARD driver correctly Initialized for the given SMARTCARD instance.
  */
hal_status_t HAL_SMARTCARD_Init(hal_smartcard_handle_t *hsmartcard, hal_smartcard_t instance)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(((IS_SMARTCARD_INSTANCE((USART_TypeDef *)((uint32_t)instance)))));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check input parameters */
  if (hsmartcard == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->instance      = instance;
  hsmartcard->tx_xfer_size  = 0;
  hsmartcard->rx_xfer_size  = 0;
  hsmartcard->tx_xfer_count = 0;
  hsmartcard->rx_xfer_count = 0;

#if defined(USE_HAL_SMARTCARD_REGISTER_CALLBACKS) && (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  SMARTCARD_InitCallbacksToDefault(hsmartcard);
#endif /* (USE_HAL_SMARTCARD_REGISTER_CALLBACKS) */

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
  /* Initialize the number of data to process during RX/TX ISR execution */
  hsmartcard->nb_tx_data_to_process = 1;
  hsmartcard->nb_rx_data_to_process = 1;
  hsmartcard->fifo_status = HAL_SMARTCARD_FIFO_MODE_DISABLED;
#endif /* USE_HAL_SMARTCARD_FIFO */

#if defined (USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
  hsmartcard->hdma_tx = (hal_dma_handle_t *)NULL;
  hsmartcard->hdma_rx = (hal_dma_handle_t *)NULL;
#endif /* USE_HAL_SMARTCARD_DMA */

#if defined (USE_HAL_SMARTCARD_USER_DATA) && (USE_HAL_SMARTCARD_USER_DATA == 1)
  /* Reset the user data pointer to NULL */
  hsmartcard->p_user_data = NULL;
#endif /* USE_HAL_SMARTCARD_USER_DATA */

#if defined (USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
  hsmartcard->last_error_codes = 0;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */

#if defined(USE_HAL_SMARTCARD_CLK_ENABLE_MODEL) && (USE_HAL_SMARTCARD_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  SMARTCARD_EnableClock(hsmartcard);
#endif /* USE_HAL_SMARTCARD_CLK_ENABLE_MODEL */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /* Create the SMARTCARD semaphore */
  if (HAL_OS_SemaphoreCreate(&hsmartcard->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_HAL_MUTEX */

  hsmartcard->global_state = HAL_SMARTCARD_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief De-Initialize the HAL SMARTCARD driver for the given handle.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                   the configuration information for SMARTCARD module.
  * @retval HAL_OK HAL SMARTCARD driver correctly deinitialized for the given SMARTCARD handle.
  */
hal_status_t HAL_SMARTCARD_DeInit(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  ASSERT_DBG_PARAM(IS_SMARTCARD_INSTANCE(p_smartcardx));

  const hal_smartcard_state_t temp_state = hsmartcard->global_state;
  /* Check if any transfer ongoing */
  if ((temp_state == HAL_SMARTCARD_STATE_RX_ACTIVE) || (temp_state == HAL_SMARTCARD_STATE_TX_ACTIVE))
  {
    /* Stop current process/operation(s) */
    SMARTCARD_Abort(hsmartcard);

#if defined(USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
    if (hsmartcard->hdma_tx != NULL)
    {
      if (LL_USART_IsEnabledDMAReq_TX(p_smartcardx) != 0U)
      {
        LL_USART_DisableDMAReq_TX(p_smartcardx);

        /* No call back execution at end of DMA abort procedure */
        (void)HAL_DMA_Abort(hsmartcard->hdma_tx);
      }
    }
    if (hsmartcard->hdma_rx != NULL)
    {
      LL_USART_DisableDMAReq_RX(p_smartcardx);

      /* Abort the SMARTCARD DMA Rx channel : use blocking DMA Abort API (no callback) */
      if (LL_USART_IsEnabledDMAReq_RX(p_smartcardx) != 0U)
      {
        (void)HAL_DMA_Abort(hsmartcard->hdma_rx);
      }
    }
#endif /* USE_HAL_SMARTCARD_DMA */

    /* Clear the Error flags in the ICR register */
    LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF
                       | LL_USART_ICR_FECF | LL_USART_ICR_RTOCF | LL_USART_ICR_EOBCF);
  }

  LL_USART_Disable(p_smartcardx);

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /* Delete the SMARTCARD semaphore */
  (void)HAL_OS_SemaphoreDelete(&hsmartcard->semaphore);
#endif /* USE_HAL_MUTEX */

  /* Reset the global state */
  hsmartcard->global_state = HAL_SMARTCARD_STATE_RESET;

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup SMARTCARD_Exported_Functions_Group2 General Config functions
  * @{
  This subsection provides a set of functions allowing configuration of the USARTx peripheral in SMARTCARD mode:

  - Global configuration:
    - HAL_SMARTCARD_SetConfig(), set the minimum required configuration into the handler instance registers.
    - HAL_SMARTCARD_GetConfig(), fetch the minimum required configuration from the handler instance registers.
  */
/**
  * @brief  Configure the SMARTCARD according to user parameters in the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  p_config Pointer to the configuration structure
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_SetConfig(hal_smartcard_handle_t *hsmartcard, const hal_smartcard_config_t *p_config)
{
  USART_TypeDef *p_smartcardx;
  uint32_t instance_clock_freq;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_BAUD_RATE(p_config->baud_rate));
  ASSERT_DBG_PARAM(IS_SMARTCARD_STOP_BITS(p_config->stop_bits));
  ASSERT_DBG_PARAM(IS_SMARTCARD_FIRST_BIT(p_config->first_bit));
  ASSERT_DBG_PARAM(IS_SMARTCARD_PARITY(p_config->parity));
  ASSERT_DBG_PARAM(IS_SMARTCARD_NACK(p_config->nack));
  ASSERT_DBG_PARAM(IS_SMARTCARD_CLOCK_PRESCALER(p_config->clock_prescaler));
  ASSERT_DBG_PARAM(IS_SMARTCARD_SCLK_PRESCALER(p_config->sclk_prescaler));
  ASSERT_DBG_PARAM(IS_SMARTCARD_CLOCK_OUTPUT(p_config->clock_output));
  ASSERT_DBG_PARAM(IS_SMARTCARD_CLOCK_POLARITY(p_config->clock_polarity));
  ASSERT_DBG_PARAM(IS_SMARTCARD_CLOCK_PHASE(p_config->clock_phase));
  ASSERT_DBG_PARAM(IS_SMARTCARD_GUARD_TIME(p_config->guard_time_etu));
  ASSERT_DBG_PARAM(IS_SMARTCARD_RETRY_COUNT(p_config->auto_retry_count));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

