MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_INIT | (uint32_t)HAL_SMARTCARD_STATE_IDLE));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetPrescaler(p_smartcardx, (uint32_t)p_config->clock_prescaler);

  LL_USART_SetSmartcardGuardTime(p_smartcardx, p_config->guard_time_etu);
  LL_USART_SetSmartcardPrescaler(p_smartcardx, (uint32_t)p_config->sclk_prescaler);

  LL_USART_SetSmartcardConfig(p_smartcardx, (uint32_t)p_config->stop_bits, (uint32_t)p_config->first_bit,
                              (uint32_t)p_config->parity, (uint32_t)p_config->nack, p_config->auto_retry_count);
  LL_USART_SetSmartcardClockConfig(p_smartcardx, (uint32_t)p_config->clock_output, (uint32_t)p_config->clock_polarity,
                                   (uint32_t)p_config->clock_phase);

  instance_clock_freq = HAL_RCC_USART_GetKernelClkFreq(p_smartcardx);
  ASSERT_DBG_PARAM(instance_clock_freq != 0U);

  ASSERT_DBG_PARAM(SMARTCARD_Check_uart_baudrate_validity(instance_clock_freq, p_config->clock_prescaler,
                                                          p_config->baud_rate) == HAL_OK);
  LL_USART_SetBaudRate(p_smartcardx, instance_clock_freq, (uint32_t)p_config->clock_prescaler, LL_USART_OVERSAMPLING_16,
                       p_config->baud_rate);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Retrieve the SMARTCARD configuration from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  p_config Pointer to the configuration structure
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMARTCARD_GetConfig(const hal_smartcard_handle_t *hsmartcard, hal_smartcard_config_t *p_config)
{
  USART_TypeDef *p_smartcardx;
  uint32_t reg_temp;
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));

  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  p_config->parity = (hal_smartcard_parity_t)LL_USART_GetParity(p_smartcardx);
  reg_temp = LL_USART_READ_REG(p_smartcardx, CR2);
  p_config->first_bit = (hal_smartcard_bit_order_t)(uint32_t)(reg_temp & (USART_CR2_MSBFIRST));
  p_config->stop_bits = (hal_smartcard_stop_bits_t)(uint32_t)(reg_temp & (USART_CR2_STOP));
  p_config->clock_output = (hal_smartcard_clock_output_t)(uint32_t)(reg_temp & (USART_CR2_CLKEN));
  p_config->clock_phase = (hal_smartcard_clock_phase_t)(uint32_t)(reg_temp & (USART_CR2_CPHA));
  p_config->clock_polarity = (hal_smartcard_clock_polarity_t)(uint32_t)(reg_temp & (USART_CR2_CPOL));
  reg_temp = LL_USART_READ_REG(p_smartcardx, CR3);
  p_config->auto_retry_count = (uint32_t)((reg_temp & (USART_CR3_SCARCNT)) >> USART_CR3_SCARCNT_Pos);
  if (((reg_temp & (uint32_t)USART_CR3_NACK)) != 0U)
  {
    p_config->nack = HAL_SMARTCARD_NACK_ENABLE;
  }
  else
  {
    p_config->nack = HAL_SMARTCARD_NACK_DISABLE;
  }
  reg_temp = LL_USART_READ_REG(p_smartcardx, GTPR);
  p_config->guard_time_etu = (uint32_t)((reg_temp & (USART_GTPR_GT)) >> USART_GTPR_GT_Pos);
  p_config->sclk_prescaler = (hal_smartcard_source_clock_prescaler_t)(uint32_t)(reg_temp & (USART_GTPR_PSC));
  uint32_t instance_clock_freq = HAL_RCC_USART_GetKernelClkFreq(p_smartcardx);

  p_config->clock_prescaler = (hal_smartcard_prescaler_t)LL_USART_GetPrescaler(p_smartcardx);
  p_config->baud_rate = LL_USART_GetBaudRate(p_smartcardx, instance_clock_freq, (uint32_t)p_config->clock_prescaler,
                                             LL_USART_OVERSAMPLING_16);
  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup SMARTCARD_Exported_Functions_Group3 Unitary basic config functions
  * @{
  This subsection provides a set of unitary functions allowing to configure the USARTx peripheral in SMARTCARD mode:

  - Unitary configuration :
    - HAL_SMARTCARD_SetBaudRate(), set the baud rate value into the handler instance registers.
    - HAL_SMARTCARD_GetBaudRate(), fetch the baud rate value from the handler instance registers.
    - HAL_SMARTCARD_SetStopBits(), set the stop bits value into the handler instance registers.
    - HAL_SMARTCARD_GetStopBits(), fetch the stop bits value from the handler instance registers.
    - HAL_SMARTCARD_SetFirstBit(), set the first bit sent (MSB or LSB) value into the handler instance registers.
    - HAL_SMARTCARD_GetFirstBit(), fetch the first bit sent (MSB or LSB) value from the handler instance registers.
    - HAL_SMARTCARD_SetParity(), set the parity value into the handler instance registers.
    - HAL_SMARTCARD_GetParity(), fetch the parity value from the handler instance registers.
    - HAL_SMARTCARD_SetNack(), set the nack value (NACK transmission is enabled/disabled in case of parity error)
      into the handler instance registers.
    - HAL_SMARTCARD_GetNack(), fetch the nack value from the handler instance registers.
    - HAL_SMARTCARD_SetClockOutput(), set the clock output value into the handler instance registers.
    - HAL_SMARTCARD_GetClockOutput(), fetch the clock output value from the handler instance registers.
    - HAL_SMARTCARD_SetClockPolarity(), set the clock polarity value into the handler instance registers.
    - HAL_SMARTCARD_GetClockPolarity(), fetch the clock polarity value from the handler instance registers.
    - HAL_SMARTCARD_SetClockPhase(), set the clock phase value into the handler instance registers.
    - HAL_SMARTCARD_GetClockPhase(), fetch the clock phase value from the handler instance registers.
    - HAL_SMARTCARD_SetGuardTime(), set the guard time value into the handler instance registers.
    - HAL_SMARTCARD_GetGuardTime(), fetch the guard time value from the handler instance registers.
    - HAL_SMARTCARD_SetAutoRetryCount(),set the auto retry value into the handler instance registers.
    - HAL_SMARTCARD_GetAutoRetryCount(), fetch the auto retry count value from the handler instance registers.

    Those parameters have the following default state :

    | Parameter           | Default register state                  |
    |---------------------|:---------------------------------------:|
    | Baud rate           |     0U (This value must be changed)     |
    | StopBits            |  HAL_SMARTCARD_STOP_BIT_1(unavailable)  |
    | FirstBit            |    HAL_SMARTCARD_BIT_ORDER_LSB_FIRST    |
    | Parity              |         HAL_SMARTCARD_PARITY_ODD        |
    | Nack                |       HAL_SMARTCARD_NACK_DISABLE        |
    | ClockOutput         |    HAL_SMARTCARD_CLOCK_OUTPUT_DISABLE   |
    | ClockPolarity       |     HAL_SMARTCARD_CLOCK_POLARITY_LOW    |
    | ClockPhase          |     HAL_SMARTCARD_CLOCK_PHASE_1_EDGE    |
    | GuardTime           |                   0U                    |
    | AutoRetryCount      |                   0U                    |
  */

/**
  * @brief  Set the SMARTCARD baud rate configuration passed in parameters into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  baud_rate SMARTCARD baud rate
  * @retval HAL_OK SMARTCARD baud rate set successfully
  * @retval HAL_INVALID_PARAM Invalid baud rate parameter
  */
hal_status_t HAL_SMARTCARD_SetBaudRate(const hal_smartcard_handle_t *hsmartcard, uint32_t baud_rate)
{
  USART_TypeDef *p_smartcardx;
  uint32_t instance_clock_freq;
  uint32_t instance_clock_prescaler;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_BAUD_RATE(baud_rate));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check input parameters */
  if (baud_rate == 0U)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  instance_clock_freq = HAL_RCC_USART_GetKernelClkFreq(p_smartcardx);
  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

