MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  instance_clock_prescaler = LL_USART_GetPrescaler(p_smartcardx);
  ASSERT_DBG_PARAM(SMARTCARD_Check_uart_baudrate_validity(instance_clock_freq, instance_clock_prescaler, baud_rate)
                   == HAL_OK);
  LL_USART_SetBaudRate(p_smartcardx, instance_clock_freq, instance_clock_prescaler, LL_USART_OVERSAMPLING_16,
                       baud_rate);


  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);
  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD baud rate configuration from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval uint32_t SMARTCARD baud rate value
  */
uint32_t HAL_SMARTCARD_GetBaudRate(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;
  uint32_t instance_clock_freq;
  uint32_t baud_rate;
  uint32_t prescaler;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  instance_clock_freq = HAL_RCC_USART_GetKernelClkFreq(p_smartcardx);
  ASSERT_DBG_PARAM(instance_clock_freq != 0U);

  prescaler = LL_USART_GetPrescaler(p_smartcardx);
  baud_rate = LL_USART_GetBaudRate(p_smartcardx, instance_clock_freq, prescaler, LL_USART_OVERSAMPLING_16);
  return baud_rate;
}

/**
  * @brief  Set the Stop Bits configuration passed in parameters into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  stop_bits SMARTCARD stop bit
  * @retval HAL_OK SMARTCARD stop bit value set successfully
  */
hal_status_t HAL_SMARTCARD_SetStopBits(const hal_smartcard_handle_t *hsmartcard, hal_smartcard_stop_bits_t stop_bits)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_STOP_BITS(stop_bits));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetStopBitsLength(p_smartcardx, (uint32_t)stop_bits);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD Stop Bits configuration from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_stop_bits_t SMARTCARD stop bit value
  */
hal_smartcard_stop_bits_t HAL_SMARTCARD_GetStopBits(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return (hal_smartcard_stop_bits_t)LL_USART_GetStopBitsLength(p_smartcardx);
}

/**
  * @brief  Set the SMARTCARD first bit sent (MSB or LSB) configuration passed in parameters into
  *         the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  first_bit SMARTCARD first bit sent (MSB or LSB)
  * @retval HAL_OK SMARTCARD first bit set successfully
  */
hal_status_t HAL_SMARTCARD_SetFirstBit(const hal_smartcard_handle_t *hsmartcard,
                                       hal_smartcard_bit_order_t first_bit)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_FIRST_BIT(first_bit));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetTransferBitOrder(p_smartcardx, (uint32_t)first_bit);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD first bit sent (MSB or LSB) configuration from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_bit_order_t SMARTCARD first bit sent (MSB or LSB)
  */
hal_smartcard_bit_order_t HAL_SMARTCARD_GetFirstBit(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  return (hal_smartcard_bit_order_t)LL_USART_GetTransferBitOrder(p_smartcardx);
}

/**
  * @brief  Set the SMARTCARD parity configuration passed in parameters into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  parity SMARTCARD parity mode
  * @retval HAL_OK SMARTCARD parity mode set successfully
  */
hal_status_t HAL_SMARTCARD_SetParity(const hal_smartcard_handle_t *hsmartcard, hal_smartcard_parity_t parity)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_PARITY(parity));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetParity(p_smartcardx, (uint32_t)parity);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD parity configuration from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_parity_t SMARTCARD parity mode
  */
hal_smartcard_parity_t HAL_SMARTCARD_GetParity(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

