MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  return (hal_smartcard_parity_t)LL_USART_GetParity(p_smartcardx);
}

/**
  * @brief  Set SMARTCARD nack management setting configuration passed in parameters into
  *         the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  nack SMARTCARD nack management setting
  * @retval HAL_OK nack management set successfully
  */
hal_status_t HAL_SMARTCARD_SetNack(const hal_smartcard_handle_t *hsmartcard, hal_smartcard_nack_state_t nack)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_NACK(nack));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  if (nack != HAL_SMARTCARD_NACK_DISABLE)
  {
    LL_USART_EnableSmartcardNACK(p_smartcardx);
  }
  else
  {
    LL_USART_DisableSmartcardNACK(p_smartcardx);
  }

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get SMARTCARD nack management setting configuration from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_nack_state_t nack status
  */
hal_smartcard_nack_state_t HAL_SMARTCARD_GetNack(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  if (LL_USART_IsEnabledSmartcardNACK(p_smartcardx) != 0U)
  {
    return HAL_SMARTCARD_NACK_ENABLE;
  }
  else
  {
    return HAL_SMARTCARD_NACK_DISABLE;
  }
}

/**
  * @brief  Enable the SMARTCARD clock output.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  clock_output SMARTCARD clock output setting from \ref hal_smartcard_clock_output_t
  * @retval HAL_OK SMARTCARD clock output enabled successfully
  */
hal_status_t HAL_SMARTCARD_SetClockOutput(const hal_smartcard_handle_t *hsmartcard,
                                          hal_smartcard_clock_output_t clock_output)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_CLOCK_OUTPUT(clock_output));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  if (clock_output != HAL_SMARTCARD_CLOCK_OUTPUT_DISABLE)
  {
    LL_USART_EnableSCLKOutput(p_smartcardx);
  }
  else
  {
    LL_USART_DisableSCLKOutput(p_smartcardx);
  }

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get SMARTCARD clock output configuration from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_clock_output_t clock output status
  */
hal_smartcard_clock_output_t HAL_SMARTCARD_GetClockOutput(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  if (LL_USART_IsEnabledSCLKOutput(p_smartcardx) != 0U)
  {
    return HAL_SMARTCARD_CLOCK_OUTPUT_ENABLE;
  }
  else
  {
    return HAL_SMARTCARD_CLOCK_OUTPUT_DISABLE;
  }
}

/**
  * @brief  Set the SMARTCARD clock polarity configuration passed in parameters into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  clock_polarity SMARTCARD clock polarity
  * @retval HAL_OK SMARTCARD clock polarity set successfully
  */
hal_status_t HAL_SMARTCARD_SetClockPolarity(const hal_smartcard_handle_t *hsmartcard,
                                            hal_smartcard_clock_polarity_t clock_polarity)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_CLOCK_POLARITY(clock_polarity));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetClockPolarity(p_smartcardx, (uint32_t)clock_polarity);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD clock polarity configuration from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_clock_polarity_t SMARTCARD clock polarity
  */
hal_smartcard_clock_polarity_t HAL_SMARTCARD_GetClockPolarity(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return (hal_smartcard_clock_polarity_t)LL_USART_GetClockPolarity(p_smartcardx);
}

/**
  * @brief  Set the SMARTCARD clock phase configuration passed in parameters into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  clock_phase SMARTCARD clock phase
  * @retval HAL_OK SMARTCARD clock phase set successfully
  */
hal_status_t HAL_SMARTCARD_SetClockPhase(const hal_smartcard_handle_t *hsmartcard,
                                         hal_smartcard_clock_phase_t clock_phase)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_CLOCK_PHASE(clock_phase));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetClockPhase(p_smartcardx, (uint32_t)clock_phase);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD clock phase configuration from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_clock_phase_t SMARTCARD clock phase
  */
hal_smartcard_clock_phase_t HAL_SMARTCARD_GetClockPhase(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return (hal_smartcard_clock_phase_t)LL_USART_GetClockPhase(p_smartcardx);
}

/**
  * @brief  Set the SMARTCARD guard time configuration passed in parameters into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  guard_time_etu SMARTCARD guard time (Elementary Time Unit)
  * @note   guard time is expressed in etu (Elementary Time Unit), in SMARTCARD case etu is the baud period duration.
  * @retval HAL_OK SMARTCARD guard time set successfully
  */
hal_status_t HAL_SMARTCARD_SetGuardTime(const hal_smartcard_handle_t *hsmartcard, uint32_t guard_time_etu)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_GUARD_TIME(guard_time_etu));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetSmartcardGuardTime(p_smartcardx, guard_time_etu);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD guard time configuration from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @note   guard time is expressed in etu (Elementary Time Unit), in SMARTCARD case etu is the baud period duration.
  * @retval uint32_t SMARTCARD guard time
  */
uint32_t HAL_SMARTCARD_GetGuardTime(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return LL_USART_GetSmartcardGuardTime(p_smartcardx);
}

/**
  * @brief  Set the SMARTCARD auto retry count feature into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  retry_count SMARTCARD retry count
  * @retval HAL_OK SMARTCARD retry count set successfully
  */
hal_status_t HAL_SMARTCARD_SetAutoRetryCount(const hal_smartcard_handle_t *hsmartcard, uint32_t retry_count)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_RETRY_COUNT(retry_count));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetSmartcardAutoRetryCount(p_smartcardx, retry_count);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD auto retry count feature from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval uint32_t SMARTCARD retry count
  */
uint32_t HAL_SMARTCARD_GetAutoRetryCount(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

