MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  return LL_USART_GetSmartcardAutoRetryCount(p_smartcardx);
}

/**
  * @}
  */

/** @addtogroup SMARTCARD_Exported_Functions_Group4 Advanced config functions
  * @{
  This subsection provides a set of functions allowing to configure optional USARTx parameters for SMARTCARD mode:

  - Pin inversion:
    - HAL_SMARTCARD_EnableIOInvert(), enable pin active level logic inversion into the handler instance registers.
    - HAL_SMARTCARD_DisableIOInvert(), disable pin active level logic inversion into the handler instance registers.
    - HAL_SMARTCARD_IsEnabledIOInvert(), fetch pin active level logic inversion status from the handler
      instance registers.
    - HAL_SMARTCARD_EnableDataInvert(), enable binary data logic inversion into the handler instance registers.
    - HAL_SMARTCARD_DisableDataInvert(), disable binary data logic inversion into the handler instance registers.
    - HAL_SMARTCARD_IsEnabledDataInvert(), fetch binary data logic inversion status from the handler
      instance registers.
    - HAL_SMARTCARD_EnableTxRxSwap(), enable USART GPIO swap into the handler instance registers.
    - HAL_SMARTCARD_DisableTxRxSwap(), disable USART GPIO swap into the handler instance registers.
    - HAL_SMARTCARD_IsEnabledTxRxSwap(), fetch USART GPIO swap status from the handler instance registers.

  - Rx overrun :
    - HAL_SMARTCARD_EnableRxOverRunDetection(), enable Rx overrun errors detection into the handler instance registers.
    - HAL_SMARTCARD_DisableRxOverRunDetection(), disable Rx overrun errors detection into the handler
      instance registers.
    - HAL_SMARTCARD_IsEnabledRxOverRunDetection(), fetch Rx overrun error detection status from the handler
      instance registers.

  - DMA disable on Rx error:
    - HAL_SMARTCARD_EnableDMAStopOnRxError(), enable DMA stop on Rx error into the handler instance registers.
    - HAL_SMARTCARD_DisableDMAStopOnRxError(), disable DMA stop on Rx error into the handler instance registers.
    - HAL_SMARTCARD_IsEnabledDMAStopOnRxError(), fetch DMA stop on Rx error status from the handler instance registers.

  - Timeout:
    - HAL_SMARTCARD_SetReceiverTimeout(), set the Rx timeout value into the handler instance registers.
    - HAL_SMARTCARD_GetReceiverTimeout(), fetch the Rx timeout value from the handler instance registers.
    - HAL_SMARTCARD_EnableReceiverTimeout(), enable Rx timeout detection into the handler instance registers.
    - HAL_SMARTCARD_DisableReceiverTimeout(), disable Rx timeout detection into the handler instance registers.
    - HAL_SMARTCARD_IsEnabledReceiverTimeout(), fetch Rx timeout detection status from the handler instance registers.

  - Tx complete indication:
    - HAL_SMARTCARD_SetTxCpltIndication(), set the guard time Tx complete indication into the handler
      instance registers.
    - HAL_SMARTCARD_GetTxCpltIndication(), fetch the guard time Tx complete indication from the handler
      instance registers.

  - Block length:
    - HAL_SMARTCARD_SetBlockLength(), set the block length value into the handler instance registers.
    - HAL_SMARTCARD_GetBlockLength(), fetch the block length value from the handler instance registers.
    - HAL_SMARTCARD_EnableEndOfBlockIT(), enable end of block interrupt into the handler instance registers.
    - HAL_SMARTCARD_DisableEndOfBlockIT(), disable end of block interrupt into the handler instance registers.
    - HAL_SMARTCARD_IsEnabledEndOfBlockIT(), fetch end of block interrupt status from the handler instance registers.

  Those optional parameters have the following default state:

  | Parameter           | Default register state                  |
  |---------------------|:---------------------------------------:|
  | IOInversion         |    HAL_SMARTCARD_IO_INVERT_DISABLED     |
  | DataInvert          |   HAL_SMARTCARD_DATA_INVERT_DISABLED    |
  | TxRxSwap            |    HAL_SMARTCARD_TX_RX_SWAP_DISABLED    |
  | RxOverRunDetection  |   HAL_SMARTCARD_OVERRUN_DETECT_ENABLED  |
  | DMAStopOnRxError    |       HAL_SMARTCARD_DMA_STOP_NONE       |
  | ReceiverTimeout     |     HAL_SMARTCARD_TIMEOUT_DISABLED      |
  | TxCpltIndication    | HAL_SMARTCARD_TX_CPLT_AFTER_GUARD_TIME  |
  | BlockLength         |                   0U                    |
  */

/**
  * @brief  Enable SMARTCARD pin active level logic inversion into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK Tx inversion feature enabled successfully
  */
hal_status_t HAL_SMARTCARD_EnableIOInvert(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetTXPinLevel(p_smartcardx, LL_USART_TXPIN_LEVEL_INVERTED);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Disable SMARTCARD pin active level logic inversion into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK Tx inversion feature disabled successfully
  */
hal_status_t HAL_SMARTCARD_DisableIOInvert(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetTXPinLevel(p_smartcardx, LL_USART_TXPIN_LEVEL_STANDARD);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD pin active level logic inversion status from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_inversion_status_t SMARTCARD Tx inversion feature status
  */
hal_smartcard_io_invert_status_t HAL_SMARTCARD_IsEnabledIOInvert(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  if (LL_USART_GetTXPinLevel(p_smartcardx) != 0U)
  {
    return HAL_SMARTCARD_IO_INVERT_ENABLED;
  }
  else
  {
    return HAL_SMARTCARD_IO_INVERT_DISABLED;
  }
}

/**
  * @brief Enable the binary Data Inversion into the handler instance registers, (1=L, 0=H).
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @retval HAL_OK SMARTCARD instance has been correctly configured.
  */
hal_status_t HAL_SMARTCARD_EnableDataInvert(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);

  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

