MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  LL_USART_SetBinaryDataLogic(p_smartcardx, LL_USART_BINARY_LOGIC_NEGATIVE);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief Disable the binary Data Inversion into the handler instance registers (1=H, 0=L).
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @retval HAL_OK SMARTCARD instance has been correctly configured.
  */
hal_status_t HAL_SMARTCARD_DisableDataInvert(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);

  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetBinaryDataLogic(p_smartcardx, LL_USART_BINARY_LOGIC_POSITIVE);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief Return the binary Data Inversion status according to the handler instance registers.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @retval hal_smartcard_data_invert_status_t Current Data Inversion status.
  */
hal_smartcard_data_invert_status_t HAL_SMARTCARD_IsEnabledDataInvert(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  if (LL_USART_GetBinaryDataLogic(p_smartcardx) == LL_USART_BINARY_LOGIC_POSITIVE)
  {
    return HAL_SMARTCARD_DATA_INVERT_DISABLED;
  }
  else
  {
    return HAL_SMARTCARD_DATA_INVERT_ENABLED;
  }
}

/**
  * @brief Enable the Swap between Tx and Rx Pin into the handler instance registers.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @retval HAL_OK SMARTCARD instance has been correctly configured.
  */
hal_status_t HAL_SMARTCARD_EnableTxRxSwap(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);

  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetTXRXSwap(p_smartcardx, LL_USART_TXRX_SWAPPED);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief Disable the Swap between Tx and Rx Pin into the handler instance registers.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @retval HAL_OK SMARTCARD instance has been correctly configured.
  */
hal_status_t HAL_SMARTCARD_DisableTxRxSwap(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);

  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetTXRXSwap(p_smartcardx, LL_USART_TXRX_STANDARD);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief Return the Swap between Tx and Rx Pin status according to the handler instance registers.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @retval hal_smartcard_tx_rx_swap_status_t Current Tx Rx Swap status.
  */
hal_smartcard_tx_rx_swap_status_t HAL_SMARTCARD_IsEnabledTxRxSwap(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  if (LL_USART_GetTXRXSwap(p_smartcardx) == LL_USART_TXRX_STANDARD)
  {
    return HAL_SMARTCARD_TX_RX_SWAP_DISABLED;
  }
  else
  {
    return HAL_SMARTCARD_TX_RX_SWAP_ENABLED;
  }
}

/**
  * @brief  Enable SMARTCARD RxOverrun detection into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK Rx overrun feature enabled successfully
  */
hal_status_t HAL_SMARTCARD_EnableRxOverRunDetection(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_EnableOverrunDetect(p_smartcardx);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Disable SMARTCARD RxOverrun detection into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK Rx overrun feature disabled successfully
  */
hal_status_t HAL_SMARTCARD_DisableRxOverRunDetection(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_DisableOverrunDetect(p_smartcardx);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD RxOverrun detection status from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_rx_overrun_detection_status_t SMARTCARD Rx overrun feature status
  */
hal_smartcard_rx_overrun_detection_status_t HAL_SMARTCARD_IsEnabledRxOverRunDetection(const
    hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return (hal_smartcard_rx_overrun_detection_status_t)LL_USART_IsEnabledOverrunDetect(p_smartcardx);
}

/**
  * @brief  Enable SMARTCARD DMA stop on Rx error into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK DMA stop on Rx error feature enabled successfully
  */
hal_status_t HAL_SMARTCARD_EnableDMAStopOnRxError(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_EnableDMADeactOnRxErr(p_smartcardx);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Disable SMARTCARD DMA stop on Rx error into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK DMA stop on Rx error feature disabled successfully
  */
hal_status_t HAL_SMARTCARD_DisableDMAStopOnRxError(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_DisableDMADeactOnRxErr(p_smartcardx);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD DMA stop on Rx error status from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_dma_stop_status_t SMARTCARD DMA stop on Rx error feature status
  */
hal_smartcard_dma_stop_status_t HAL_SMARTCARD_IsEnabledDMAStopOnRxError(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  if (LL_USART_IsEnabledDMADeactOnRxErr(p_smartcardx) != 0U)
  {
    return HAL_SMARTCARD_DMA_STOP_ON_RX_ERROR;
  }
  else
  {
    return HAL_SMARTCARD_DMA_STOP_NONE;
  }
}

/**
  * @brief  Set the SMARTCARD receiver timeout value passed in parameters into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  timeout_etu SMARTCARD receiver timeout value
  * @note   timeout is expressed in etu (Elementary Time Unit), in SMARTCARD case etu is the baud period duration.
  * @retval HAL_OK SMARTCARD receiver timeout value set successfully
  */
hal_status_t HAL_SMARTCARD_SetReceiverTimeout(const hal_smartcard_handle_t *hsmartcard, uint32_t timeout_etu)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_TIMEOUT_VALUE(timeout_etu));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  LL_USART_SetRxTimeout(p_smartcardx, timeout_etu);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD receiver timeout value from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @note   timeout is expressed in etu (Elementary Time Unit), in SMARTCARD case etu is the baud period duration.
  * @retval uint32_t SMARTCARD receiver timeout value
  */
uint32_t HAL_SMARTCARD_GetReceiverTimeout(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  return LL_USART_GetRxTimeout(p_smartcardx);
}

/**
  * @brief  Enable SMARTCARD Receiver Timeout feature into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK Receiver Timeout feature enabled successfully
  */
hal_status_t HAL_SMARTCARD_EnableReceiverTimeout(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  LL_USART_EnableRxTimeout(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Disable SMARTCARD Receiver Timeout feature into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK Receiver Timeout feature disabled successfully
  */
hal_status_t HAL_SMARTCARD_DisableReceiverTimeout(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  LL_USART_DisableRxTimeout(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD Receiver Timeout feature status from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_timeout_status_t SMARTCARD Receiver Timeout feature status
  */
hal_smartcard_timeout_status_t HAL_SMARTCARD_IsEnabledReceiverTimeout(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

