MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  return (hal_smartcard_timeout_status_t)LL_USART_IsEnabledRxTimeout(p_smartcardx);
}

/**
  * @brief  Set the SMARTCARD Pre guard time Tx complete indication passed in parameters
  *         into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  tx_cplt_indication SMARTCARD Pre guard time Tx complete indication
  * @retval HAL_OK SMARTCARD Tx completion indication set successfully
  */
hal_status_t HAL_SMARTCARD_SetTxCpltIndication(hal_smartcard_handle_t *hsmartcard,
                                               const hal_smartcard_tx_cplt_guard_time_indication_t tx_cplt_indication)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_TX_CPLT(tx_cplt_indication));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  hsmartcard->tx_cplt_indication = tx_cplt_indication;

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD Pre guard time Tx complete indication feature from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_tx_cplt_guard_time_indication_t  SMARTCARD Pre guard time Tx complete indication
  */
hal_smartcard_tx_cplt_guard_time_indication_t HAL_SMARTCARD_GetTxCpltIndication(
  const hal_smartcard_handle_t *hsmartcard)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));

  return hsmartcard->tx_cplt_indication;
}

/**
  * @brief  Set the SMARTCARD block length for T=1 smartcard protocol passed in parameters into
  *         the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  block_length_byte block length
  * @retval HAL_OK SMARTCARD block length set successfully
  */
hal_status_t HAL_SMARTCARD_SetBlockLength(const hal_smartcard_handle_t *hsmartcard, uint32_t block_length_byte)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_BLOCK_LENGTH(block_length_byte));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  LL_USART_SetBlockLength(p_smartcardx, block_length_byte);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD block length for T=1 smartcard protocol from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval uint32_t SMARTCARD block length
  */
uint32_t HAL_SMARTCARD_GetBlockLength(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return LL_USART_GetBlockLength(p_smartcardx);
}
/**
  * @brief  Enable SMARTCARD End of block interrupt into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK End of block interrupt enabled successfully
  */
hal_status_t HAL_SMARTCARD_EnableEndOfBlockIT(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  LL_USART_EnableIT_EOB(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Disable SMARTCARD End of block interrupt into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK End of block interrupt disabled successfully
  */
hal_status_t HAL_SMARTCARD_DisableEndOfBlockIT(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  LL_USART_DisableIT_EOB(p_smartcardx);

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD End of block interrupt status from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_end_of_block_interrupt_status_t SMARTCARD End of block interrupt status
  */
hal_smartcard_end_of_block_interrupt_status_t HAL_SMARTCARD_IsEnabledEndOfBlockIT(const hal_smartcard_handle_t
    *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return (hal_smartcard_end_of_block_interrupt_status_t)LL_USART_IsEnabledIT_EOB(p_smartcardx);
}

/**
  * @}
  */
/** @addtogroup SMARTCARD_Exported_Functions_Group5 FIFO config functions
  * @{
  This subsection provides a set of functions allowing use of the FIFO mode feature for the USARTx instance.
  Before using the FIFO mode feature, configure the instance with HAL_SMARTCARD_SetConfig().
  The following functions are provided to use the FIFO mode feature:
    - HAL_SMARTCARD_EnableFifoMode(), enable FIFO in the handler instance registers.
    - HAL_SMARTCARD_DisableFifoMode(), disable FIFO in the handler instance registers.
    - HAL_SMARTCARD_IsEnabledFifoMode(), fetch FIFO status from the handler instance registers.
    - HAL_SMARTCARD_SetTxFifoThreshold(), set the Tx FIFO threshold value in the handler instance registers.
    - HAL_SMARTCARD_GetTxFifoThreshold(), fetch the Tx FIFO threshold value from the handler instance registers.
    - HAL_SMARTCARD_SetRxFifoThreshold(), set the Rx FIFO threshold value in the handler instance registers.
    - HAL_SMARTCARD_GetRxFifoThreshold(), fetch the Rx FIFO threshold value from the handler instance registers.

    Use the following procedure:
    - HAL_SMARTCARD_SetTxFifoThreshold()
    - HAL_SMARTCARD_SetRxFifoThreshold()
    - HAL_SMARTCARD_EnableFifoMode()
    - Start the process, for example: HAL_SMARTCARD_Receive()
  */
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
/**
  * @brief  Enable SMARTCARD FIFO mode into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK FIFO feature enabled successfully
  */
hal_status_t HAL_SMARTCARD_EnableFifoMode(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_EnableFIFO(p_smartcardx);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  hsmartcard->fifo_status = HAL_SMARTCARD_FIFO_MODE_ENABLED;

  return HAL_OK;
}

/**
  * @brief  Disable SMARTCARD FIFO mode into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval HAL_OK FIFO feature disabled successfully
  */
hal_status_t HAL_SMARTCARD_DisableFifoMode(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_DisableFIFO(p_smartcardx);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  hsmartcard->fifo_status = HAL_SMARTCARD_FIFO_MODE_DISABLED;

  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD FIFO status from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_fifo_mode_status_t SMARTCARD FIFO feature status
  */
hal_smartcard_fifo_mode_status_t HAL_SMARTCARD_IsEnabledFifoMode(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return (hal_smartcard_fifo_mode_status_t)LL_USART_IsEnabledFIFO(p_smartcardx);
}

/**
  * @brief  Set the SMARTCARD Tx FIFO threshold value passed in parameters into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  tx_fifo_threshold SMARTCARD Tx FIFO threshold value
  * @retval HAL_OK SMARTCARD Tx FIFO threshold value set successfully
  */
hal_status_t HAL_SMARTCARD_SetTxFifoThreshold(hal_smartcard_handle_t *hsmartcard,
                                              const hal_smartcard_fifo_threshold_t tx_fifo_threshold)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_FIFO_THRESHOLD(tx_fifo_threshold));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetTXFIFOThreshold(p_smartcardx, (uint32_t)tx_fifo_threshold);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

