MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  uint8_t numerator[]   = {1U, 1U, 1U, 3U, 7U, 1U, 0U, 0U};
  uint8_t shift_amount[] = {3U, 2U, 1U, 2U, 3U, 0U, 0U, 0U};

  hsmartcard->nb_tx_data_to_process = ((uint16_t)TX_FIFO_DEPTH * numerator[tx_fifo_threshold])
                                      >> shift_amount[tx_fifo_threshold];
  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD Tx FIFO threshold value from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_fifo_threshold_t SMARTCARD Tx FIFO threshold value
  */
hal_smartcard_fifo_threshold_t HAL_SMARTCARD_GetTxFifoThreshold(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return (hal_smartcard_fifo_threshold_t)LL_USART_GetTXFIFOThreshold(p_smartcardx);
}

/**
  * @brief  Set the SMARTCARD Rx FIFO threshold value passed in parameters into the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  rx_fifo_threshold SMARTCARD Rx FIFO threshold value
  * @retval HAL_OK SMARTCARD Rx FIFO threshold value set successfully
  */
hal_status_t HAL_SMARTCARD_SetRxFifoThreshold(hal_smartcard_handle_t *hsmartcard,
                                              const hal_smartcard_fifo_threshold_t rx_fifo_threshold)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_FIFO_THRESHOLD(rx_fifo_threshold));

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)HAL_SMARTCARD_STATE_IDLE);
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  SMARTCARD_ENSURE_INSTANCE_DISABLED(p_smartcardx);

  LL_USART_SetRXFIFOThreshold(p_smartcardx, (uint32_t)rx_fifo_threshold);

  SMARTCARD_ENSURE_INSTANCE_ENABLED(p_smartcardx);

  uint8_t numerator[]   = {1U, 1U, 1U, 3U, 7U, 1U, 0U, 0U};
  uint8_t shift_amount[] = {3U, 2U, 1U, 2U, 3U, 0U, 0U, 0U};

  hsmartcard->nb_rx_data_to_process = ((uint16_t)RX_FIFO_DEPTH * numerator[rx_fifo_threshold])
                                      >> shift_amount[rx_fifo_threshold];
  return HAL_OK;
}

/**
  * @brief  Get the SMARTCARD Rx FIFO threshold value from the handler instance registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @retval hal_smartcard_fifo_threshold_t SMARTCARD Rx FIFO threshold
  */
hal_smartcard_fifo_threshold_t HAL_SMARTCARD_GetRxFifoThreshold(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;

  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return (hal_smartcard_fifo_threshold_t)LL_USART_GetRXFIFOThreshold(p_smartcardx);
}
#endif /* USE_HAL_SMARTCARD_FIFO */

/**
  * @}
  */

/** @addtogroup SMARTCARD_Exported_Functions_Group6 IO operation functions
  * @{
  This subsection provides a set of functions that allow managing SMARTCARD data transfers.

 There are two transfer modes:
    - Blocking mode: The communication is performed in polling mode.
      The HAL status of all data processing is returned by the same function
      after finishing transfer.
    - Non-blocking mode: The communication is performed using interrupts
      or DMA. These APIs return the HAL status.
      The end of the data processing is indicated through the
      dedicated SMARTCARD IRQ when using interrupt mode or the DMA IRQ when
      using DMA mode.
      The HAL_SMARTCARD_TxCpltCallback() and HAL_SMARTCARD_RxCpltCallback() user callbacks
      are executed, respectively, at the end of the transmit or receive process.
      The HAL_SMARTCARD_ErrorCallback() user callback is executed when a communication error is detected.

  Polling APIs:
    - HAL_SMARTCARD_Transmit(), transmit an amount of data in blocking mode.
    - HAL_SMARTCARD_Receive(), receive an amount of data in blocking mode.
    - HAL_SMARTCARD_Abort(), abort data transfer.

  IT APIs:
    - HAL_SMARTCARD_Transmit_IT(), transmit an amount of data in interrupt mode.
    - HAL_SMARTCARD_Transmit_IT_Opt(), transmit an amount of data in interrupt mode,
      enabling given optional interrupts.
    - HAL_SMARTCARD_Receive_IT(), receive an amount of data in interrupt mode.
    - HAL_SMARTCARD_Receive_IT_Opt(), receive an amount of data in interrupt mode, enabling given optional interrupts.
    - HAL_SMARTCARD_Abort_IT(), abort data transfer and call HAL_SMARTCARD_AbortCpltCallback().

  DMA APIs:
    - HAL_SMARTCARD_Transmit_DMA(), transmit an amount of data in DMA mode.
    - HAL_SMARTCARD_Transmit_DMA_Opt(), transmit an amount of data in DMA mode, enabling given optional interrupts.
    - HAL_SMARTCARD_Receive_DMA(), receive an amount of data in DMA mode.
    - HAL_SMARTCARD_Receive_DMA_Opt(), receive an amount of data in DMA mode, enabling given optional interrupts.
  */

/**
  * @brief  Send an amount of data in blocking mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  p_data pointer to data buffer.
  * @param  size_byte amount of data to be sent.
  * @param  timeout_ms Timeout duration.
  * @note   When FIFO mode is enabled, writing a data in the TDR register adds one
  *         data to the TXFIFO. Write operations to the TDR register are performed
  *         when TXFNF flag is set. From hardware perspective, TXFNF flag and
  *         TXE are mapped on the same bit-field.
  * @retval HAL_OK Operation started successfully
  * @retval HAL_TIMEOUT Transfer timeout
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_Transmit(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data,
                                    uint16_t size_byte, uint32_t timeout_ms)
{
  USART_TypeDef *p_smartcardx;
  uint32_t tickstart;
  const uint8_t *ptmpdata = p_data;

  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);

  ASSERT_DBG_STATE(hsmartcard->global_state, HAL_SMARTCARD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  HAL_CHECK_UPDATE_STATE(hsmartcard, global_state, HAL_SMARTCARD_STATE_IDLE, HAL_SMARTCARD_STATE_TX_ACTIVE);

#if defined (USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
  hsmartcard->last_error_codes = HAL_SMARTCARD_ERROR_NONE;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */

  uint32_t nack_enabled = LL_USART_IsEnabledSmartcardNACK(p_smartcardx);

