MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  /* Init tickstart for timeout management */
  tickstart = HAL_GetTick();

  /* In case of TX only mode, if NACK is enabled, the USART must be able to monitor
      the bidirectional line to detect a NACK signal in case of parity error.
      Therefore, the receiver block must be enabled as well (RE bit in register CR1 must be set). */
  if (nack_enabled != 0U)
  {
    LL_USART_SetTransferDirection(p_smartcardx, LL_USART_DIRECTION_TX_RX);
  }
  else
  {
    LL_USART_SetTransferDirection(p_smartcardx, LL_USART_DIRECTION_TX);
  }

  LL_USART_Enable(p_smartcardx);

  hsmartcard->tx_xfer_size = size_byte;
  hsmartcard->tx_xfer_count = size_byte;

  while (hsmartcard->tx_xfer_count > 0U)
  {
    hsmartcard->tx_xfer_count--;
    if (SMARTCARD_WaitOnFlagUntilTimeout(hsmartcard, LL_USART_ISR_TXE_TXFNF, 0U, tickstart, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
    LL_USART_TransmitData8(p_smartcardx, (uint8_t)(*ptmpdata & 0xFFU));
    ptmpdata++;
  }

  if (SMARTCARD_WaitOnFlagUntilTimeout(hsmartcard, SMARTCARD_TRANSMISSION_COMPLETION_FLAG(hsmartcard), 0U,
                                       tickstart, timeout_ms) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  if (nack_enabled != 0U)
  {
    /* In case of NACK enabled, USART is disabled to empty RDR register */
    LL_USART_Disable(p_smartcardx);
    LL_USART_Enable(p_smartcardx);
  }

  /* Perform a TX/RX FIFO Flush at end of Tx phase, as all sent bytes are appearing in Rx Data register */
  SMARTCARD_FLUSH_DRREGISTER(hsmartcard);

  hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Receive an amount of data in blocking mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  p_data Pointer to data buffer.
  * @param  size_byte Amount of data to be received.
  * @param  timeout_ms Timeout duration.
  * @note   When FIFO mode is enabled, the RXFNE flag is set as long as the RXFIFO
  *         is not empty. Read operations from the RDR register are performed when
  *         RXFNE flag is set. From hardware perspective, RXFNE flag and
  *         RXNE are mapped on the same bit-field.
  * @retval HAL_OK Operation started successfully
  * @retval HAL_TIMEOUT Transfer timeout
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_Receive(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data,
                                   uint16_t size_byte, uint32_t timeout_ms)
{
  USART_TypeDef *p_smartcardx;
  uint32_t tickstart;
  uint8_t *ptmpdata = p_data;
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);

  ASSERT_DBG_STATE(hsmartcard->global_state, HAL_SMARTCARD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check input parameters */
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  HAL_CHECK_UPDATE_STATE(hsmartcard, global_state, HAL_SMARTCARD_STATE_IDLE, HAL_SMARTCARD_STATE_RX_ACTIVE);

#if defined (USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
  hsmartcard->last_error_codes = HAL_SMARTCARD_ERROR_NONE;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */

  LL_USART_EnableDirectionRx(p_smartcardx);

  LL_USART_Enable(p_smartcardx);

  LL_USART_ClearFlag_ORE(p_smartcardx);

  /* Init tickstart for timeout management */
  tickstart = HAL_GetTick();

  hsmartcard->rx_xfer_size = size_byte;
  hsmartcard->rx_xfer_count = size_byte;

  /* Check the remain data to be received */
  while (hsmartcard->rx_xfer_count > 0U)
  {
    hsmartcard->rx_xfer_count--;

    if (SMARTCARD_WaitOnFlagUntilTimeout(hsmartcard, LL_USART_ISR_RXNE_RXFNE, 0U, tickstart, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
    *ptmpdata = LL_USART_ReceiveData8(p_smartcardx);
    ptmpdata++;
  }

  hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

  return HAL_OK;
}
/**
  * @brief  Send an amount of data in interrupt mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  p_data pointer to data buffer.
  * @param  size_byte amount of data to be sent.
  * @note   When FIFO mode is disabled, USART interrupt is generated whenever
  *         USART_TDR register is empty, i.e one interrupt per data to transmit.
  * @note   When FIFO mode is enabled, USART interrupt is generated whenever
  *         TXFIFO threshold reached. In that case the interrupt rate depends on
  *         TXFIFO threshold configuration.
  * @note   This function sets the hsmartcard->TxIsr function pointer according to
  *         the FIFO mode (data transmission processing depends on FIFO mode).
  * @retval HAL_OK Operation started successfully
  * @retval HAL_BUSY Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_Transmit_IT(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data, uint16_t size_byte)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);

  ASSERT_DBG_STATE(hsmartcard->global_state, HAL_SMARTCARD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hsmartcard, global_state, HAL_SMARTCARD_STATE_IDLE, HAL_SMARTCARD_STATE_TX_ACTIVE);

  return SMARTCARD_Start_Transmit_IT(hsmartcard, p_data, size_byte, HAL_SMARTCARD_OPT_TX_IT_NONE);
}

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
/**
  * @brief  Send an amount of data in interrupt mode, allows the user to enable the optional interrupts part of
  *         \ref SMARTCARD_Transmit_IT_Optional_Interrupts.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  p_data Pointer to data buffer.
  * @param  size_byte Amount of data to be sent.
  * @param  interrupts Optional interrupts part of \ref SMARTCARD_Transmit_IT_Optional_Interrupts.
  * @note   When FIFO mode is disabled, USART interrupt is generated whenever
  *         USART_TDR register is empty, i.e., one interrupt per data to transmit.
  * @note   When FIFO mode is enabled, USART interrupt is generated whenever
  *         TXFIFO threshold is reached. In that case the interrupt rate depends on
  *         TXFIFO threshold configuration.
  * @note   This function sets the hsmartcard->TxIsr function pointer according to
  *         the FIFO mode (data transmission processing depends on FIFO mode).
  * @retval HAL_OK Operation started successfully
  * @retval HAL_BUSY Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_Transmit_IT_Opt(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data,
                                           uint16_t size_byte, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_PARAM(IS_SMARTCARD_OPT_TX_IT(interrupts));

  ASSERT_DBG_STATE(hsmartcard->global_state, HAL_SMARTCARD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hsmartcard, global_state, HAL_SMARTCARD_STATE_IDLE, HAL_SMARTCARD_STATE_TX_ACTIVE);

  return SMARTCARD_Start_Transmit_IT(hsmartcard, p_data, size_byte, interrupts);
}
#endif /* USE_HAL_SMARTCARD_FIFO */

/**
  * @brief  Receive an amount of data in interrupt mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  p_data pointer to data buffer.
  * @param  size_byte amount of data to be received.
  * @note   When FIFO mode is disabled, USART interrupt is generated whenever
  *         USART_RDR register can be read, i.e one interrupt per data to receive.
  * @note   When FIFO mode is enabled, USART interrupt is generated whenever
  *         RXFIFO threshold reached. In that case the interrupt rate depends on
  *         RXFIFO threshold configuration.
  * @note   This function sets the hsmartcard->RxIsr function pointer according to
  *         the FIFO mode (data reception processing depends on FIFO mode).
  * @retval HAL_OK Operation started successfully
  * @retval HAL_BUSY Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_Receive_IT(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data, uint16_t size_byte)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);

  ASSERT_DBG_STATE(hsmartcard->global_state, HAL_SMARTCARD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

