MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  HAL_CHECK_UPDATE_STATE(hsmartcard, global_state, HAL_SMARTCARD_STATE_IDLE, HAL_SMARTCARD_STATE_RX_ACTIVE);

  return SMARTCARD_Start_Receive_IT(hsmartcard, (uint8_t *)p_data, size_byte, HAL_SMARTCARD_OPT_RX_IT_NONE);
}
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
/**
  * @brief  Receive an amount of data in interrupt mode, allows the user to enable the optional interrupts part of
  *         \ref SMARTCARD_Receive_IT_Optional_Interrupts.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  p_data Pointer to data buffer.
  * @param  size_byte Amount of data to be received.
  * @param  interrupts Optional interrupts part of \ref SMARTCARD_Receive_IT_Optional_Interrupts.
  * @note   When FIFO mode is disabled, USART interrupt is generated whenever
  *         USART_RDR register can be read, i.e., one interrupt per data to receive.
  * @note   When FIFO mode is enabled, USART interrupt is generated whenever
  *         RXFIFO threshold is reached. In that case the interrupt rate depends on
  *         RXFIFO threshold configuration.
  * @note   This function sets the hsmartcard->RxIsr function pointer according to
  *         the FIFO mode (data reception processing depends on FIFO mode).
  * @retval HAL_OK Operation started successfully
  * @retval HAL_BUSY Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_Receive_IT_Opt(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data,
                                          uint16_t size_byte, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_PARAM(IS_SMARTCARD_OPT_RX_IT(interrupts));

  ASSERT_DBG_STATE(hsmartcard->global_state, HAL_SMARTCARD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hsmartcard, global_state, HAL_SMARTCARD_STATE_IDLE, HAL_SMARTCARD_STATE_RX_ACTIVE);

  return SMARTCARD_Start_Receive_IT(hsmartcard, (uint8_t *)p_data, size_byte, interrupts);
}
#endif /* USE_HAL_SMARTCARD_FIFO */

#if defined (USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
/**
  * @brief  Send an amount of data in DMA mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  p_data pointer to data buffer.
  * @param  size_byte amount of data to be sent.
  * @retval HAL_OK Operation started successfully
  * @retval HAL_ERROR DMA did not start successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_Transmit_DMA(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data, uint16_t size_byte)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_PARAM(hsmartcard->hdma_tx != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, HAL_SMARTCARD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U) || (hsmartcard->hdma_tx == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hsmartcard, global_state, HAL_SMARTCARD_STATE_IDLE, HAL_SMARTCARD_STATE_TX_ACTIVE);

  return SMARTCARD_Start_Transmit_DMA(hsmartcard, p_data, size_byte, HAL_SMARTCARD_OPT_DMA_TX_IT_HT);
}

/**
  * @brief  Send an amount of data in DMA mode, allows the user to enable the optional interrupts part of
  *         \ref SMARTCARD_Transmit_DMA_Optional_Interrupts.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  p_data Pointer to data buffer.
  * @param  size_byte Amount of data to be sent.
  * @param  interrupts Optional interrupts part of \ref SMARTCARD_Transmit_DMA_Optional_Interrupts.
  * @retval HAL_OK Operation started successfully
  * @retval HAL_ERROR DMA did not start successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_Transmit_DMA_Opt(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data,
                                            uint16_t size_byte, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_PARAM(hsmartcard->hdma_tx != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_OPT_TX_DMA(interrupts));

  ASSERT_DBG_STATE(hsmartcard->global_state, HAL_SMARTCARD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U) || (hsmartcard->hdma_tx == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hsmartcard, global_state, HAL_SMARTCARD_STATE_IDLE, HAL_SMARTCARD_STATE_TX_ACTIVE);

  return SMARTCARD_Start_Transmit_DMA(hsmartcard, p_data, size_byte, interrupts);

}

/**
  * @brief  Receive an amount of data in DMA mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  p_data pointer to data buffer.
  * @param  size_byte amount of data to be received.
  * @note   The SMARTCARD-associated USART parity is enabled (PCE = 1),
  *         the received data contains the parity bit (MSB position).
  * @retval HAL_OK Operation started successfully
  * @retval HAL_ERROR DMA did not start successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_Receive_DMA(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data, uint16_t size_byte)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_PARAM(hsmartcard->hdma_rx != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, HAL_SMARTCARD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U) || (hsmartcard->hdma_rx == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  HAL_CHECK_UPDATE_STATE(hsmartcard, global_state, HAL_SMARTCARD_STATE_IDLE, HAL_SMARTCARD_STATE_RX_ACTIVE);

