MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  return (SMARTCARD_Start_Receive_DMA(hsmartcard, (uint8_t *)p_data, size_byte, HAL_SMARTCARD_OPT_DMA_RX_IT_HT));
}

/**
  * @brief  Receive an amount of data in DMA mode, allows the user to enable the optional interrupts part of
  *         \ref SMARTCARD_Receive_DMA_Optional_Interrupts.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  p_data Pointer to data buffer.
  * @param  size_byte Amount of data to be received.
  * @param  interrupts Optional interrupts part of \ref SMARTCARD_Receive_DMA_Optional_Interrupts.
  * @note   The SMARTCARD-associated USART parity is enabled (PCE = 1),
  *         the received data contains the parity bit (MSB position).
  * @retval HAL_OK Operation started successfully
  * @retval HAL_ERROR DMA did not start successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_Receive_DMA_Opt(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data,
                                           uint16_t size_byte, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_PARAM(hsmartcard->hdma_rx != NULL);
  ASSERT_DBG_PARAM(IS_SMARTCARD_OPT_RX_DMA(interrupts));

  ASSERT_DBG_STATE(hsmartcard->global_state, HAL_SMARTCARD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U) || (hsmartcard->hdma_rx == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  HAL_CHECK_UPDATE_STATE(hsmartcard, global_state, HAL_SMARTCARD_STATE_IDLE, HAL_SMARTCARD_STATE_RX_ACTIVE);

  return (SMARTCARD_Start_Receive_DMA(hsmartcard, (uint8_t *)p_data, size_byte, interrupts));
}
#endif /* USE_HAL_SMARTCARD_DMA */

/**
  * @brief  Abort ongoing transfers either Tx or Rx (blocking mode).
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @note   This procedure can be used to abort any ongoing transfer started in interrupt or DMA mode.
  *         This procedure performs the following operations:
  *           - Disable SMARTCARD interrupts (Tx and Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to HAL_SMARTCARD_STATE_IDLE
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL_OK Operation successfully aborted
  * @retval HAL_TIMEOUT Abort timeout
  */
hal_status_t HAL_SMARTCARD_Abort(hal_smartcard_handle_t *hsmartcard)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  hsmartcard->global_state = HAL_SMARTCARD_STATE_ABORT;
  SMARTCARD_Abort(hsmartcard);

#if defined(USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
  if (LL_USART_IsEnabledDMAReq_TX(p_smartcardx) != 0U)
  {
    if (hsmartcard->hdma_tx != NULL)
    {
      LL_USART_DisableDMAReq_TX(p_smartcardx);

      /* No call back execution at end of DMA abort procedure */
      (void)HAL_DMA_Abort(hsmartcard->hdma_tx);
    }
  }
  if (LL_USART_IsEnabledDMAReq_RX(p_smartcardx) != 0U)
  {
    LL_USART_DisableDMAReq_RX(p_smartcardx);

    /* Abort the SMARTCARD DMA Rx channel : use blocking DMA Abort API (no callback) */
    if (hsmartcard->hdma_rx != NULL)
    {
      (void)HAL_DMA_Abort(hsmartcard->hdma_rx);
    }
  }
#endif /* USE_HAL_SMARTCARD_DMA */

  /* Reset Tx and Rx transfer counters */
  hsmartcard->tx_xfer_count = 0U;
  hsmartcard->rx_xfer_count = 0U;

  /* Clear the Error flags in the ICR register */
  LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF
                     | LL_USART_ICR_FECF | LL_USART_ICR_RTOCF | LL_USART_ICR_EOBCF);

  /* Restore hsmartcard->global_state to Idle */
  hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Abort ongoing transfers either Tx or Rx (Interrupt mode).
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable SMARTCARD Interrupts (Tx and Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle state to HAL_SMARTCARD_STATE_IDLE
  *           - At abort completion, call the user abort complete callback
  * @note   This procedure is executed in interrupt mode, meaning that the abort procedure is
  *         considered complete only when the user abort complete callback is executed (not when exiting the function).
  * @retval HAL_OK Operation successfully aborted
  */
hal_status_t HAL_SMARTCARD_Abort_IT(hal_smartcard_handle_t *hsmartcard)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  hsmartcard->global_state = HAL_SMARTCARD_STATE_ABORT;
  SMARTCARD_Abort(hsmartcard);

#if defined(USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
  uint32_t abortcplt = 1U;
  /* If DMA Tx and/or DMA Rx Handles are associated to SMARTCARD Handle,
     DMA Abort complete callbacks must be initialised before any call
     to DMA Abort functions */
  /* DMA Tx Handle is valid */
  if (hsmartcard->hdma_tx != NULL)
  {
    /* Set DMA Abort Complete callback if SMARTCARD DMA Tx request if enabled.
       Otherwise, set it to NULL */
    if (LL_USART_IsEnabledDMAReq_TX(p_smartcardx) != 0U)
    {
      hsmartcard->hdma_tx->p_xfer_abort_cb = SMARTCARD_DMATxAbortCallback;

      LL_USART_DisableDMAReq_TX(p_smartcardx);

      /* Abort the SMARTCARD DMA Tx channel : use non blocking DMA Abort API (callback) */
      if (HAL_DMA_Abort_IT(hsmartcard->hdma_tx) == HAL_OK)
      {
        abortcplt = 0U;
      }
    }
  }
  /* DMA Rx Handle is valid */
  if (hsmartcard->hdma_rx != NULL)
  {
    /* Set DMA Abort Complete callback if SMARTCARD DMA Rx request if enabled.
       Otherwise, set it to NULL */
    if (LL_USART_IsEnabledDMAReq_RX(p_smartcardx) != 0U)
    {
      hsmartcard->hdma_rx->p_xfer_abort_cb = SMARTCARD_DMARxAbortCallback;
      LL_USART_DisableDMAReq_RX(p_smartcardx);

