MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
      /* SMARTCARD Rx DMA abort callback has already been initialized:
        it will lead to a call to HAL_SMARTCARD_AbortCpltCallback() at the end of the DMA abort procedure */
      if (HAL_DMA_Abort_IT(hsmartcard->hdma_rx) != HAL_OK)
      {
        abortcplt = 1U;
      }
      else
      {
        abortcplt = 0U;
      }
    }
  }

  /* If no DMA abort complete callback execution is required, call the user abort complete callback. */
  if (abortcplt != 0U)
#endif /* USE_HAL_SMARTCARD_DMA */
  {
    /* Reset Tx and Rx transfer counters */
    hsmartcard->tx_xfer_count = 0U;
    hsmartcard->rx_xfer_count = 0U;

    /* Clear ISR function pointers */
    hsmartcard->p_rx_isr = NULL;
    hsmartcard->p_tx_isr = NULL;

    /* Clear the Error flags in the ICR register */
    LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF
                       | LL_USART_ICR_FECF | LL_USART_ICR_RTOCF | LL_USART_ICR_EOBCF);

    hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

    /* As no DMA is to be aborted, call the user abort complete callback directly. */
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
    hsmartcard->p_abort_cplt_callback(hsmartcard);
#else
    HAL_SMARTCARD_AbortCpltCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup SMARTCARD_Exported_Functions_Group7
  * @{
  This subsection provides a set of functions allowing to link the HAL SMARTCARD handle to a Tx and Rx DMA handler
  for the USARTx instance.
  A set of functions is provided to use the DMA feature:
    - HAL_SMARTCARD_SetTxDMA(): Link a DMA instance to the Tx channel
    - HAL_SMARTCARD_SetRxDMA(): Link a DMA instance to the Rx channel
 */
#if defined (USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
/**
  * @brief Set DMA channel for Transmission.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @param hdma_tx Pointer to a hal_dma_handle_t structure which contains the DMA instance
  * @retval HAL_OK The channel has been correctly set.
  * @retval HAL_INVALID_PARAM hdma_tx is NULL.
  */
hal_status_t HAL_SMARTCARD_SetTxDMA(hal_smartcard_handle_t *hsmartcard, hal_dma_handle_t *hdma_tx)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(hdma_tx != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_IDLE | (uint32_t)HAL_SMARTCARD_STATE_INIT));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_tx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->hdma_tx = hdma_tx;
  hdma_tx->p_parent = hsmartcard;

  return HAL_OK;
}

/**
  * @brief Set DMA channel for Reception.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @param hdma_rx Pointer to a hal_dma_handle_t structure which contains the DMA instance
  * @retval HAL_OK The channel has been correctly set.
  * @retval HAL_INVALID_PARAM hdma_rx is NULL.
  */
hal_status_t HAL_SMARTCARD_SetRxDMA(hal_smartcard_handle_t *hsmartcard, hal_dma_handle_t *hdma_rx)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(hdma_rx != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_IDLE | (uint32_t)HAL_SMARTCARD_STATE_INIT));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_rx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->hdma_rx = hdma_rx;
  hdma_rx->p_parent = hsmartcard;

  return HAL_OK;
}
#endif /* USE_HAL_SMARTCARD_DMA */

/**
  * @}
  */

/** @defgroup SMARTCARD_Exported_Functions_Group8 IRQHandler and Default Callbacks
  * @{
This subsection provides the function handling the interruption of the SMARTCARDx in asynchronous mode.

  - HAL_SMARTCARD_IRQHandler(): process the interruption of an instance

  HAL_SMARTCARD_IRQHandler() is designed to process the different interruptions in the following order:
    - Error on Rx side (PE, FE, NE, ORE, RTOF)
    - Error on DMA side
    - Data on Rx side
    - Data on Tx side
    - FIFO Empty (Tx)
    - FIFO Full (Rx)

  Depending on the process function one's use, different callback might be triggered:

| Process API \n \ \n Callbacks      | HAL_SMARTCARD_Transmit_IT | HAL_SMARTCARD_Receive_IT |
|------------------------------------|:-------------------------:|:------------------------:|
| HAL_SMARTCARD_TxCpltCallback       |             x             |                          |
| HAL_SMARTCARD_RxCpltCallback       |                           |             x            |
| HAL_SMARTCARD_ErrorCallback        |             x             |             x            |

| Process API \n \ \n Callbacks      | HAL_SMARTCARD_Transmit_IT_Opt | HAL_SMARTCARD_Receive_IT_Opt |
|------------------------------------|:-----------------------------:|:----------------------------:|
| HAL_SMARTCARD_TxCpltCallback       |               x               |                              |
| HAL_SMARTCARD_RxCpltCallback       |                               |               x              |
| HAL_SMARTCARD_ErrorCallback        |               x               |               x              |
| HAL_SMARTCARD_TxFifoEmptyCallback* |               x               |                              |
| HAL_SMARTCARD_RxFifoFullCallback** |                               |               x              |
@note * with HAL_SMARTCARD_OPT_TX_IT_FIFO_EMPTY arguments value for interrupts parameter
@note ** with HAL_SMARTCARD_OPT_RX_IT_FIFO_FULL arguments value for interrupts parameter

| Process API \n \ \n Callbacks       | HAL_SMARTCARD_Transmit_DMA | HAL_SMARTCARD_Receive_DMA |
|-------------------------------------|:--------------------------:|:-------------------------:|
| HAL_SMARTCARD_TxHalfCpltCallback*   |               x            |                           |
| HAL_SMARTCARD_TxCpltCallback        |               x            |                           |
| HAL_SMARTCARD_RxHalfCpltCallback*   |                            |              x            |
| HAL_SMARTCARD_RxCpltCallback        |                            |              x            |
| HAL_SMARTCARD_ErrorCallback**       |               x            |              x            |
@note * these callbacks might be called following DMA IRQ management, not SMARTCARDx IRQ management.
@note ** these callbacks might be called following DMA IRQ management, or SMARTCARDx IRQ management.

| Process API \n \ \n Callbacks       | HAL_SMARTCARD_Transmit_DMA_Opt | HAL_SMARTCARD_Receive_DMA_Opt |
|-------------------------------------|:------------------------------:|:-----------------------------:|
| HAL_SMARTCARD_TxHalfCpltCallback    |               x                |                               |
| HAL_SMARTCARD_TxCpltCallback        |               x                |                               |
| HAL_SMARTCARD_RxHalfCpltCallback    |                                |                x              |
| HAL_SMARTCARD_RxCpltCallback        |                                |                x              |
| HAL_SMARTCARD_TxFifoEmptyCallback*  |               x                |                               |
| HAL_SMARTCARD_RxFifoFullCallback**  |                                |                x              |
| HAL_SMARTCARD_ErrorCallback         |               x                |                x              |
@note * with HAL_SMARTCARD_OPT_TX_IT_FIFO_EMPTY arguments value for interrupts parameter
@note ** with HAL_SMARTCARD_OPT_RX_IT_FIFO_FULL arguments value for interrupts parameter

| Process API \n \ \n Callbacks           | HAL_SMARTCARD_Abort_IT |
|-----------------------------------------|:----------------------:|
| HAL_SMARTCARD_AbortCpltCallback         |            x           |
| HAL_SMARTCARD_ErrorCallback             |            x           |
  */

/**
  * @brief Handle SMARTCARD interrupt request.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains the configuration
  * information for SMARTCARD module.
  */
void HAL_SMARTCARD_IRQHandler(hal_smartcard_handle_t *hsmartcard)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);

