MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  uint32_t isrflags   = LL_USART_READ_REG(p_smartcardx, ISR);
  uint32_t cr1its     = LL_USART_READ_REG(p_smartcardx, CR1);
  uint32_t cr3its     = LL_USART_READ_REG(p_smartcardx, CR3);
  uint32_t errorflags;

  /* If no error occurs */
  errorflags = (isrflags & (uint32_t)(USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE | USART_ISR_RTOF));
  if (errorflags == 0U)
  {
    /* SMARTCARD in mode Receiver ---------------------------------------------------*/
    if (((isrflags & USART_ISR_RXNE_RXFNE) != 0U)
        && (((cr1its & USART_CR1_RXNEIE_RXFNEIE) != 0U)
            || ((cr3its & USART_CR3_RXFTIE) != 0U)))
    {
      if (hsmartcard->p_rx_isr != NULL)
      {
        hsmartcard->p_rx_isr(hsmartcard);
      }
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
      /* As RXFF ISR is delayed compared to RXFT ISR we have to use the RXFT ISR to use the Fifo Full callback */
      if (((cr1its & USART_CR1_RXFFIE) != 0U) && ((cr3its & USART_CR3_RXFTIE) != 0U)
          && (((cr3its & USART_CR3_RXFTCFG) >> USART_CR3_RXFTCFG_Pos) == LL_USART_FIFO_THRESHOLD_8_8))
      {
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
        hsmartcard->p_rx_fifo_full_callback(hsmartcard);
#else
        HAL_SMARTCARD_RxFifoFullCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
      }
#endif /* USE_HAL_SMARTCARD_FIFO */
      return;
    }
  }

  /* If some errors occur */
  if ((errorflags != 0U)
      && ((((cr3its & (USART_CR3_RXFTIE | USART_CR3_EIE)) != 0U)
           || ((cr1its & (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE)) != 0U))))
  {
    /* SMARTCARD parity error interrupt occurred -------------------------------------*/
    if (((isrflags & USART_ISR_PE) != 0U) && ((cr1its & USART_CR1_PEIE) != 0U))
    {
      LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_PECF);

#if defined(USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
      hsmartcard->last_error_codes |= HAL_SMARTCARD_RECEIVE_ERROR_PE;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
    }

    /* SMARTCARD frame error interrupt occurred --------------------------------------*/
    if (((isrflags & USART_ISR_FE) != 0U) && ((cr3its & USART_CR3_EIE) != 0U))
    {
      LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_FECF);

#if defined(USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
      if (hsmartcard->global_state == HAL_SMARTCARD_STATE_TX_ACTIVE)
      {
        hsmartcard->last_error_codes |= HAL_SMARTCARD_TRANSMIT_ERROR_NACK;
      }
      else
      {
        hsmartcard->last_error_codes |= HAL_SMARTCARD_RECEIVE_ERROR_FE;
      }
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
    }

    /* SMARTCARD noise error interrupt occurred --------------------------------------*/
    if (((isrflags & USART_ISR_NE) != 0U) && ((cr3its & USART_CR3_EIE) != 0U))
    {
      LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_NECF);

#if defined(USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
      hsmartcard->last_error_codes |= HAL_SMARTCARD_RECEIVE_ERROR_NE;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
    }

    /* SMARTCARD Over-Run interrupt occurred -----------------------------------------*/
    if (((isrflags & USART_ISR_ORE) != 0U)
        && (((cr1its & USART_CR1_RXNEIE_RXFNEIE) != 0U)
            || ((cr3its & USART_CR3_RXFTIE) != 0U)
            || ((cr3its & USART_CR3_EIE) != 0U)))
    {
      /* Discard Overrun Error occurring in Transmit phase */
      if (LL_USART_IsEnabledDirectionTx(p_smartcardx) != 0U)
      {
        errorflags = (errorflags & ~USART_ISR_ORE);
      }
#if defined(USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
      else
      {
        hsmartcard->last_error_codes |= HAL_SMARTCARD_RECEIVE_ERROR_ORE;
      }
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
      LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_ORECF);

    }

    /* SMARTCARD receiver timeout interrupt occurred -----------------------------------------*/
    if (((isrflags & USART_ISR_RTOF) != 0U) && ((cr1its & USART_CR1_RTOIE) != 0U))
    {
      LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_RTOCF);

#if defined(USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
      hsmartcard->last_error_codes |= HAL_SMARTCARD_RECEIVE_ERROR_RTO;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
    }

    /* Call SMARTCARD Error Call back function if need be --------------------------*/
    if (errorflags != 0U)
    {
      /* SMARTCARD in mode Receiver ---------------------------------------------------*/
      if (((isrflags & USART_ISR_RXNE_RXFNE) != 0U)
          && (((cr1its & USART_CR1_RXNEIE_RXFNEIE) != 0U)
              || ((cr3its & USART_CR3_RXFTIE) != 0U)))
      {
        if (hsmartcard->p_rx_isr != NULL)
        {
          hsmartcard->p_rx_isr(hsmartcard);
        }
      }

      /* If Error is to be considered as blocking :
          - Receiver Timeout error in Reception
          - Overrun error in Reception
          - any error occurs in DMA mode reception
      */
      if ((LL_USART_IsEnabledDMAReq_RX(p_smartcardx) != 0U)
          || ((errorflags & (USART_ISR_RTOF | USART_ISR_ORE)) != 0U))
      {
        /* Blocking error : transfer is aborted
           Set the SMARTCARD state ready to be able to start again the process,
           Disable Rx Interrupts, and disable Rx DMA request, if ongoing */

#if defined(USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
        if (LL_USART_IsEnabledDMAReq_RX(p_smartcardx) != 0U)
        {
          SMARTCARD_EndRxTransfer(hsmartcard);

          /* Abort the SMARTCARD DMA Rx channel */
          if (hsmartcard->hdma_rx != NULL)
          {
            /* Set the SMARTCARD DMA Abort callback :
               will lead to call HAL_SMARTCARD_ErrorCallback() at end of DMA abort procedure */
            hsmartcard->hdma_rx->p_xfer_abort_cb = SMARTCARD_DMAAbortOnError;

