MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
            /* Abort DMA RX */
            if (HAL_DMA_Abort_IT(hsmartcard->hdma_rx) != HAL_OK)
            {
              /* Call Directly hsmartcard->hdma_rx->p_xfer_abort_cb function in case of error */
              hsmartcard->hdma_rx->p_xfer_abort_cb(hsmartcard->hdma_rx);
            }
          }
          else
          {
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
            hsmartcard->p_error_callback(hsmartcard);
#else
            HAL_SMARTCARD_ErrorCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
          }
        }
        else
#endif /* USE_HAL_SMARTCARD_DMA */
        {
          SMARTCARD_EndRxTransfer(hsmartcard);
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
          hsmartcard->p_error_callback(hsmartcard);
#else
          HAL_SMARTCARD_ErrorCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
        }
      }
      /* other error type to be considered as blocking :
          - Frame error flag in Transmission (No ack despite trials)
      */
      else if ((hsmartcard->global_state == HAL_SMARTCARD_STATE_TX_ACTIVE)
               && ((errorflags & USART_ISR_FE) != 0U))
      {
        /* Blocking error : transfer is aborted
           Set the SMARTCARD state ready to be able to start again the process,
           Disable Tx Interrupts, and disable Tx DMA request, if ongoing */

#if defined(USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
        if (LL_USART_IsEnabledDMAReq_TX(p_smartcardx) != 0U)
        {
          SMARTCARD_EndTxTransfer(hsmartcard);

          /* Abort the SMARTCARD DMA Tx channel */
          if (hsmartcard->hdma_tx != NULL)
          {
            /* Set the SMARTCARD DMA Abort callback :
               will lead to call HAL_SMARTCARD_ErrorCallback() at end of DMA abort procedure */
            hsmartcard->hdma_tx->p_xfer_abort_cb = SMARTCARD_DMAAbortOnError;

            if (HAL_DMA_Abort_IT(hsmartcard->hdma_tx) != HAL_OK)
            {
              /* Call Directly hsmartcard->hdma_tx->p_xfer_abort_cb function in case of error */
              hsmartcard->hdma_tx->p_xfer_abort_cb(hsmartcard->hdma_tx);
            }
          }
          else
          {
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
            hsmartcard->p_error_callback(hsmartcard);
#else
            HAL_SMARTCARD_ErrorCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
          }
        }
        else
#endif /* USE_HAL_SMARTCARD_DMA */
        {
          SMARTCARD_EndTxTransfer(hsmartcard);
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
          hsmartcard->p_error_callback(hsmartcard);
#else
          HAL_SMARTCARD_ErrorCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
        }
      }
      else
      {
        /* Non Blocking error : transfer could go on.
           Error is notified to user through user error callback */
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
        hsmartcard->p_error_callback(hsmartcard);
#else
        HAL_SMARTCARD_ErrorCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
      }
    }
    return;

  } /* End if some error occurs */

  /* SMARTCARD in mode Receiver, end of block interruption ------------------------*/
  if (((isrflags & USART_ISR_EOBF) != 0U) && ((cr1its & USART_CR1_EOBIE) != 0U))
  {
    hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
    hsmartcard->p_rx_cplt_callback(hsmartcard);
#else
    HAL_SMARTCARD_RxCpltCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
    /* Clear EOBF interrupt after HAL_SMARTCARD_RxCpltCallback() call for the End of Block information
       to be available during HAL_SMARTCARD_RxCpltCallback() processing */
    LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_EOBCF);
    return;
  }

  /* SMARTCARD in mode Transmitter ------------------------------------------------*/
  if (((isrflags & USART_ISR_TXE_TXFNF) != 0U)
      && (((cr1its & USART_CR1_TXEIE_TXFNFIE) != 0U)
          || ((cr3its & USART_CR3_TXFTIE) != 0U)))
  {
    if (hsmartcard->p_tx_isr != NULL)
    {
      hsmartcard->p_tx_isr(hsmartcard);
    }
    return;
  }

  /* SMARTCARD in mode Transmitter (transmission end) ------------------------*/
  if (hsmartcard->tx_cplt_indication != HAL_SMARTCARD_TX_CPLT_AFTER_GUARD_TIME)
  {
    if (LL_USART_IsEnabledIT_TCBGT(p_smartcardx) != 0U)
    {
      if (LL_USART_IsActiveFlag_TCBGT(p_smartcardx) != 0U)
      {
        SMARTCARD_EndTransmit_IT(hsmartcard);
        return;
      }
    }
  }
  else
  {
    if (LL_USART_IsEnabledIT_TC(p_smartcardx) != 0U)
    {
      if (LL_USART_IsActiveFlag_TC(p_smartcardx) != 0U)
      {
        SMARTCARD_EndTransmit_IT(hsmartcard);
        return;
      }
    }
  }

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
  /* SMARTCARD TX FIFO Empty occurred ----------------------------------------------*/
  if (((isrflags & USART_ISR_TXFE) != 0U) && ((cr1its & USART_CR1_TXFEIE) != 0U))
  {
    hsmartcard->p_tx_isr(hsmartcard);
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
    hsmartcard->p_tx_fifo_empty_callback(hsmartcard);
#else
    HAL_SMARTCARD_TxFifoEmptyCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
    return;
  }
#endif /* USE_HAL_SMARTCARD_FIFO */
}

/**
  * @brief  SMARTCARD Tx completed callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @warning This function must not be modified, when the callback is needed,
  *          the HAL_SMARTCARD_TxCpltCallback() can be implemented in the user file.
  */
__WEAK void HAL_SMARTCARD_TxCpltCallback(hal_smartcard_handle_t *hsmartcard)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmartcard);
}

/**
  * @brief  SMARTCARD Tx Half completed callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @warning This function must not be modified, when the callback is needed,
  *          the HAL_SMARTCARD_TxHalfCpltCallback() can be implemented in the user file.
  */
__WEAK void HAL_SMARTCARD_TxHalfCpltCallback(hal_smartcard_handle_t *hsmartcard)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmartcard);
}

/**
  * @brief  SMARTCARD Rx completed callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @warning This function must not be modified, when the callback is needed,
             the HAL_SMARTCARD_RxCpltCallback() can be implemented in the user file.
  */
__WEAK void HAL_SMARTCARD_RxCpltCallback(hal_smartcard_handle_t *hsmartcard)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmartcard);
}

/**
  * @brief  SMARTCARD Rx Half completed callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @warning This function must not be modified, when the callback is needed,
  *          the @ref HAL_SMARTCARD_RxHalfCpltCallback() can be implemented in the user file.
  */
__WEAK void HAL_SMARTCARD_RxHalfCpltCallback(hal_smartcard_handle_t *hsmartcard)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmartcard);
}

/**
  * @brief  SMARTCARD Error callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @warning This function must not be modified, when the callback is needed,
  *          the HAL_SMARTCARD_ErrorCallback() can be implemented in the user file.
  */
__WEAK void HAL_SMARTCARD_ErrorCallback(hal_smartcard_handle_t *hsmartcard)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmartcard);
}

/**
  * @brief  SMARTCARD Abort completed callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @warning This function must not be modified, when the callback is needed,
  *          the HAL_SMARTCARD_AbortCpltCallback() can be implemented in the user file.
  */
__WEAK void HAL_SMARTCARD_AbortCpltCallback(hal_smartcard_handle_t *hsmartcard)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmartcard);

  /**
   */
}

