MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
/**
  * @brief  SMARTCARD Rx FIFO full callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @warning This function must not be modified, when the callback is needed,
  *          the HAL_SMARTCARD_RxFifoFullCallback() can be implemented in the user file.
  */
__WEAK void HAL_SMARTCARD_RxFifoFullCallback(hal_smartcard_handle_t *hsmartcard)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmartcard);
}

/**
  * @brief  SMARTCARD Tx FIFO empty callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @warning This function must not be modified, when the callback is needed,
  *          the HAL_SMARTCARD_TxFifoEmptyCallback() can be implemented in the user file.
  */
__WEAK void HAL_SMARTCARD_TxFifoEmptyCallback(hal_smartcard_handle_t *hsmartcard)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmartcard);
}

#endif /* USE_HAL_SMARTCARD_FIFO */

/**
  * @}
  */

/** @addtogroup SMARTCARD_Exported_Functions_Group9 Callbacks Register functions
  * @{
  This subsection provides a set of functions allowing to configure the Callbacks for the USARTx instance.
  Prior to configure the Callbacks, one has to configure one's with HAL_SMARTCARD_SetConfig().
  A set of functions is provided to configure the callbacks:
    - HAL_SMARTCARD_RegisterTxHalfCpltCallback(): Set the Tx half complete callback
    - HAL_SMARTCARD_RegisterTxCpltCallback(): Set the Tx complete callback
    - HAL_SMARTCARD_RegisterRxHalfCpltCallback(): Set the Rx half complete callback
    - HAL_SMARTCARD_RegisterRxCpltCallback(): Set the Rx complete callback
    - HAL_SMARTCARD_RegisterErrorCallback(): Set the error callback
    - HAL_SMARTCARD_RegisterAbortCpltCallback(): Set the abort complete callback
    - HAL_SMARTCARD_RegisterRxFifoFullCallback(): Set the Rx Fifo full callback
    - HAL_SMARTCARD_RegisterTxFifoEmptyCallback(): Set the Tx Fifo empty callback
  */
#if defined(USE_HAL_SMARTCARD_REGISTER_CALLBACKS) && (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register the SMARTCARD Tx Transfer completed callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  p_callback Pointer to the Tx Transfer completed callback function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_RegisterTxCpltCallback(hal_smartcard_handle_t *hsmartcard, hal_smartcard_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_IDLE | (uint32_t)HAL_SMARTCARD_STATE_INIT));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->p_tx_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the SMARTCARD Tx Transfer Half completed callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  p_callback Pointer to the Tx Transfer Half completed callback function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_RegisterTxHalfCpltCallback(hal_smartcard_handle_t *hsmartcard, hal_smartcard_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_IDLE | (uint32_t)HAL_SMARTCARD_STATE_INIT));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->p_tx_half_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the SMARTCARD Rx Transfer completed callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  p_callback Pointer to the Rx Transfer completed callback function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_RegisterRxCpltCallback(hal_smartcard_handle_t *hsmartcard, hal_smartcard_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_IDLE | (uint32_t)HAL_SMARTCARD_STATE_INIT));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->p_rx_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the SMARTCARD Rx Transfer Half completed callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  p_callback Pointer to the Rx Transfer Half completed callback function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_RegisterRxHalfCpltCallback(hal_smartcard_handle_t *hsmartcard, hal_smartcard_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_IDLE | (uint32_t)HAL_SMARTCARD_STATE_INIT));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->p_rx_half_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the SMARTCARD error callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  p_callback Pointer to the error callback function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_RegisterErrorCallback(hal_smartcard_handle_t *hsmartcard, hal_smartcard_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_IDLE | (uint32_t)HAL_SMARTCARD_STATE_INIT));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->p_error_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the SMARTCARD abort complete callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  p_callback Pointer to the abort complete function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_RegisterAbortCpltCallback(hal_smartcard_handle_t *hsmartcard, hal_smartcard_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_IDLE | (uint32_t)HAL_SMARTCARD_STATE_INIT));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->p_abort_cplt_callback = p_callback;

  return HAL_OK;
}

