MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
/**
  * @brief  Register the SMARTCARD Rx FIFO empty callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  p_callback Pointer to the abort Rx FIFO empty function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_RegisterRxFifoFullCallback(hal_smartcard_handle_t *hsmartcard, hal_smartcard_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_IDLE | (uint32_t)HAL_SMARTCARD_STATE_INIT));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->p_rx_fifo_full_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the SMARTCARD Tx FIFO empty callback.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t
  * @param  p_callback Pointer to the Tx FIFO empty function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMARTCARD_RegisterTxFifoEmptyCallback(hal_smartcard_handle_t *hsmartcard,
                                                       hal_smartcard_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, ((uint32_t)HAL_SMARTCARD_STATE_IDLE | (uint32_t)HAL_SMARTCARD_STATE_INIT));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmartcard->p_tx_fifo_empty_callback = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_SMARTCARD_FIFO */

#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @addtogroup SMARTCARD_Exported_Functions_Group10 State, Error and Clock Frequency functions
  * @{
  This subsection provides 2 functions allowing to read peripheral state and last occurred errors.
  - HAL_SMARTCARD_GetState() API can be helpful to check in run-time the state of the SMARTCARD peripheral
  - HAL_SMARTCARD_GetLastErrorCodes() API to retrieve the error codes in case of HAL_ERROR return
    available under the compilation switch USE_HAL_SMARTCARD_GET_LAST_ERRORS
  - HAL_SMARTCARD_GetClockFreq(), report the SMARTCARD clock frequency from the RCC configuration.
 */

/**
  * @brief Retrieve the SMARTCARD handle state.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *               the configuration information for SMARTCARD module.
  * @retval hal_smartcard_state_t SMARTCARD state
  */
hal_smartcard_state_t HAL_SMARTCARD_GetState(const hal_smartcard_handle_t *hsmartcard)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);

  return hsmartcard->global_state;
}

#if defined(USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
/**
  * @brief Retrieve the SMARTCARD errors codes.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                   the configuration information for SMARTCARD module.
  * @retval uint32_t Returned value can be a combination of the following values:
  *         @arg @ref HAL_SMARTCARD_ERROR_NONE
  *         @arg @ref HAL_SMARTCARD_RECEIVE_ERROR_PE
  *         @arg @ref HAL_SMARTCARD_RECEIVE_ERROR_NE
  *         @arg @ref HAL_SMARTCARD_RECEIVE_ERROR_FE
  *         @arg @ref HAL_SMARTCARD_RECEIVE_ERROR_ORE
  *         @arg @ref HAL_SMARTCARD_TRANSMIT_ERROR_NACK
  *         @arg @ref HAL_SMARTCARD_TRANSMIT_ERROR_DMA
  *         @arg @ref HAL_SMARTCARD_RECEIVE_ERROR_DMA
  *         @arg @ref HAL_SMARTCARD_RECEIVE_ERROR_RTO
  */
uint32_t HAL_SMARTCARD_GetLastErrorCodes(const hal_smartcard_handle_t *hsmartcard)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);

  return hsmartcard->last_error_codes;
}
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */

/** @brief  Report the SMARTCARD clock frequency from the RCC configuration.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the USART instance.
  * @retval uint32_t clock frequency
  */
uint32_t HAL_SMARTCARD_GetClockFreq(const hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx;
  ASSERT_DBG_PARAM(hsmartcard != NULL);

  ASSERT_DBG_STATE(hsmartcard->global_state, (uint32_t)(HAL_SMARTCARD_STATE_IDLE | HAL_SMARTCARD_STATE_RX_ACTIVE
                                                        | HAL_SMARTCARD_STATE_TX_ACTIVE | HAL_SMARTCARD_STATE_ABORT));
  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  return HAL_RCC_USART_GetKernelClkFreq(p_smartcardx);
}

/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @addtogroup SMARTCARD_Exported_Functions_Group11 Acquire/Release Bus functions
  * @{
  This subsection provides functions allowing to control the bus of the USARTx instance:
    - HAL_SMARTCARD_AcquireBus(): Acquire the bus
    - HAL_SMARTCARD_ReleaseBus(): Release the bus.

  For multi task application, it is strongly recommended to use the bus operation functions to avoid race concurrency.
  */
/**
  * @brief Acquire the current instance bus.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @param  timeout_ms Timeout in milliseconds for the Acquire to expire.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_SMARTCARD_AcquireBus(hal_smartcard_handle_t *hsmartcard, uint32_t timeout_ms)
{
  hal_status_t status;

  ASSERT_DBG_PARAM((hsmartcard != NULL));

  status = HAL_ERROR;

  if (HAL_OS_SemaphoreTake(&hsmartcard->semaphore, timeout_ms) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief Release the current instance bus.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_SMARTCARD_ReleaseBus(hal_smartcard_handle_t *hsmartcard)
{
  hal_status_t status;

