MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  ASSERT_DBG_PARAM((hsmartcard != NULL));

  status = HAL_ERROR;

  if (HAL_OS_SemaphoreRelease(&hsmartcard->semaphore) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @}
  */
#endif /*USE_HAL_MUTEX */

#if defined (USE_HAL_SMARTCARD_USER_DATA) && (USE_HAL_SMARTCARD_USER_DATA == 1)

/** @addtogroup SMARTCARD_Exported_Functions_Group12 UserData functions
  * @{
  This subsection provides functions allowing to set user specific data to a SMARTCARDx instance:
  - HAL_SMARTCARD_SetUserData(): Set user data in handler.
  - HAL_SMARTCARD_GetUserData(): Get user data from handler.
  */

/**
  * @brief Store User Data pointer into the handle.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @param p_user_data Pointer to the user data.
  */
void HAL_SMARTCARD_SetUserData(hal_smartcard_handle_t *hsmartcard, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);

  hsmartcard->p_user_data = p_user_data;
}

/**
  * @brief Retrieve User Data pointer from the handle.
  * @param hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @retval Pointer to the user data.
  */
const void *HAL_SMARTCARD_GetUserData(const hal_smartcard_handle_t *hsmartcard)
{
  ASSERT_DBG_PARAM(hsmartcard != NULL);

  return (hsmartcard->p_user_data);
}

/**
  * @}
  */
#endif /* USE_HAL_SMARTCARD_USER_DATA */

/**
  * @}
  */

/** @addtogroup SMARTCARD_Private_Functions SMARTCARD Private Functions
  * @{
  */
/**
  * @brief  Abort smartcard communication by disabling interruptions.
  * @param  hsmartcard SMARTCARD handle.
  */
static void SMARTCARD_Abort(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  /* Disable RTOIE, EOBIE, TXEIE, TCIE, RXNE, PE, RXFT, TXFT and
     ERR (Frame error, noise error, overrun error) interrupts */
  LL_USART_DisableIT_CR1(p_smartcardx, (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE | USART_CR1_TXEIE_TXFNFIE
                                        | USART_CR1_TCIE | USART_CR1_RTOIE | USART_CR1_EOBIE));
  LL_USART_DisableIT_CR3(p_smartcardx, (USART_CR3_EIE | USART_CR3_RXFTIE | USART_CR3_TXFTIE));
}

#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
/**
  * @brief  Initialize the callbacks to their default values.
  * @param  hsmartcard SMARTCARD handle.
  */
static void SMARTCARD_InitCallbacksToDefault(hal_smartcard_handle_t *hsmartcard)
{
  /* Init the SMARTCARD Callback settings */
  hsmartcard->p_tx_cplt_callback          = HAL_SMARTCARD_TxCpltCallback;     /* Legacy weak p_tx_cplt_callback      */
  hsmartcard->p_rx_cplt_callback          = HAL_SMARTCARD_RxCpltCallback;     /* Legacy weak p_rx_cplt_callback      */
  hsmartcard->p_tx_half_cplt_callback     = HAL_SMARTCARD_TxHalfCpltCallback; /* Legacy weak p_tx_half_cplt_callback */
  hsmartcard->p_rx_half_cplt_callback     = HAL_SMARTCARD_RxHalfCpltCallback; /* Legacy weak p_rx_half_cplt_callback */
  hsmartcard->p_error_callback            = HAL_SMARTCARD_ErrorCallback;      /* Legacy weak p_error_callback        */
  hsmartcard->p_abort_cplt_callback       = HAL_SMARTCARD_AbortCpltCallback;  /* Legacy weak p_abort_cplt_callback   */

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
  hsmartcard->p_rx_fifo_full_callback     = HAL_SMARTCARD_RxFifoFullCallback;      /* Legacy weak
                                                                                      p_rx_fifo_full_callback */
  hsmartcard->p_tx_fifo_empty_callback    = HAL_SMARTCARD_TxFifoEmptyCallback;     /* Legacy weak
                                                                                      p_tx_fifo_empty_callback */
#endif /* USE_HAL_SMARTCARD_FIFO */

}
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */

/**
  * @brief  Handle SMARTCARD Communication Timeout. It waits
  *         until a flag is no longer in the specified status.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @param  flag Specifies the SMARTCARD flag to check.
  * @param  status The actual Flag status (1U or 0U).
  * @param  tickstart Tick start value
  * @param  timeout_ms Timeout duration.
  * @retval HAL status
  */
static hal_status_t SMARTCARD_WaitOnFlagUntilTimeout(hal_smartcard_handle_t *hsmartcard, uint32_t flag,
                                                     uint32_t status, uint32_t tickstart, uint32_t timeout_ms)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  /* Wait until flag is set */
  while (LL_USART_IsActiveFlag(p_smartcardx, flag) == status)
  {
    /* Check for the Timeout */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        if (LL_USART_IsActiveFlag(p_smartcardx, flag) == status)
        {
          /* Disable TXE, RXNE, PE and ERR (Frame error, noise error, overrun error)
            interrupts for the interrupt process */
          LL_USART_DisableIT_CR1(p_smartcardx, (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE | USART_CR1_TXEIE_TXFNFIE));
          LL_USART_DisableIT_ERROR(p_smartcardx);

          hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

          return HAL_TIMEOUT;
        }
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Start Transmit operation in interrupt mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @param  p_data Pointer to data buffer (u8 data elements).
  * @param  size Amount of data elements (u8) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL SMARTCARD API providing transmission in Interrupt mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  *         SMARTCARD Handle is assumed as Locked.
  * @retval HAL_OK Transmit started in IT mode.
  */
hal_status_t SMARTCARD_Start_Transmit_IT(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data, uint32_t size,
                                         uint32_t interrupts)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  hsmartcard->p_tx_buff         = p_data;
  hsmartcard->tx_xfer_size      = size;
  hsmartcard->tx_xfer_count     = size;
  hsmartcard->p_tx_isr       = NULL;
#if defined (USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
  hsmartcard->last_error_codes = HAL_SMARTCARD_ERROR_NONE;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */

  /* In case of TX only mode, if NACK is enabled, the USART must be able to monitor
      the bidirectional line to detect a NACK signal in case of parity error.
      Therefore, the receiver block must be enabled as well (RE bit in register CR1 must be set). */
  if (LL_USART_IsEnabledSmartcardNACK(p_smartcardx) != 0U)
  {
    LL_USART_SetTransferDirection(p_smartcardx, LL_USART_DIRECTION_TX_RX);
  }
  else
  {
    LL_USART_SetTransferDirection(p_smartcardx, LL_USART_DIRECTION_TX);
  }

