MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  LL_USART_Enable(p_smartcardx);

  /* Perform a TX/RX FIFO Flush */
  SMARTCARD_FLUSH_DRREGISTER(hsmartcard);

  /* Configure Tx interrupt processing */
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)

  if (hsmartcard->fifo_status == HAL_SMARTCARD_FIFO_MODE_ENABLED)
  {
    hsmartcard->p_tx_isr = SMARTCARD_TxISR_FIFOEN;

    LL_USART_EnableIT_ERROR(p_smartcardx);

    LL_USART_EnableIT_TXFT(p_smartcardx);
  }
  else
  {
    hsmartcard->p_tx_isr = SMARTCARD_TxISR;

    LL_USART_EnableIT_ERROR(p_smartcardx);

    LL_USART_EnableIT_TXE_TXFNF(p_smartcardx);
  }

  if ((interrupts & HAL_SMARTCARD_OPT_TX_IT_FIFO_EMPTY) == HAL_SMARTCARD_OPT_TX_IT_FIFO_EMPTY)
  {
    LL_USART_EnableIT_TXFE(p_smartcardx);
  }
#else /* USE_HAL_SMARTCARD_FIFO */

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(interrupts);

  hsmartcard->p_tx_isr = SMARTCARD_TxISR;

  LL_USART_EnableIT_ERROR(p_smartcardx);
  LL_USART_EnableIT_TXE_TXFNF(p_smartcardx);
#endif /* USE_HAL_SMARTCARD_FIFO */

  return HAL_OK;
}

/**
  * @brief  Start Receive operation in interrupt mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @param  p_data Pointer to data buffer (u8 data elements).
  * @param  size Amount of data elements (u8) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL SMARTCARD API providing reception in Interrupt mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  *         SMARTCARD Handle is assumed as Locked.
  * @retval HAL_OK Receive started in IT mode.
  */
hal_status_t SMARTCARD_Start_Receive_IT(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data, uint32_t size,
                                        uint32_t interrupts)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  hsmartcard->global_state = HAL_SMARTCARD_STATE_RX_ACTIVE;

  hsmartcard->p_rx_buff = p_data;
  hsmartcard->rx_xfer_size = size;
  hsmartcard->rx_xfer_count = size;
#if defined (USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
  hsmartcard->last_error_codes = HAL_SMARTCARD_ERROR_NONE;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
  LL_USART_EnableDirectionRx(p_smartcardx);

  LL_USART_Enable(p_smartcardx);

  /* Configure Rx interrupt processing */
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
  if ((hsmartcard->fifo_status == HAL_SMARTCARD_FIFO_MODE_ENABLED) && (size >= hsmartcard->nb_rx_data_to_process))
  {
    hsmartcard->p_rx_isr = SMARTCARD_RxISR_FIFOEN;

    LL_USART_EnableIT_PE(p_smartcardx);
    LL_USART_EnableIT_RXFT(p_smartcardx);
  }
  else
  {
    hsmartcard->p_rx_isr = SMARTCARD_RxISR;

    LL_USART_EnableIT_RXNE_RXFNE(p_smartcardx);
    LL_USART_EnableIT_PE(p_smartcardx);
  }

  if ((interrupts & HAL_SMARTCARD_OPT_RX_IT_FIFO_FULL) == HAL_SMARTCARD_OPT_RX_IT_FIFO_FULL)
  {
    LL_USART_EnableIT_RXFF(p_smartcardx);
  }
#else
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(interrupts);

  hsmartcard->p_rx_isr = SMARTCARD_RxISR;

  LL_USART_EnableIT_RXNE_RXFNE(p_smartcardx);
  LL_USART_EnableIT_PE(p_smartcardx);
#endif /* USE_HAL_SMARTCARD_FIFO */

  LL_USART_EnableIT_ERROR(p_smartcardx);

  return HAL_OK;
}

#if defined (USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)

/**
  * @brief  Start Transmit operation in DMA mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @param  p_data Pointer to data buffer (u8 or u16 data elements).
  * @param  size Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL SMARTCARD API providing transmission in DMA mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  *         SMARTCARD Handle is assumed as Locked.
  * @retval HAL_OK Receive started in DMA mode.
  * @retval HAL_ERROR DMA did not start.
  */
hal_status_t SMARTCARD_Start_Transmit_DMA(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data, uint32_t size,
                                          uint32_t interrupts)
{
  USART_TypeDef *p_smartcardx;
  uint32_t interrupts_dma;

  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  hsmartcard->p_tx_buff     = p_data;
  hsmartcard->tx_xfer_size  = size;
  hsmartcard->tx_xfer_count = size;
#if defined (USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
  hsmartcard->last_error_codes = HAL_SMARTCARD_ERROR_NONE;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
  interrupts_dma = (interrupts & HAL_SMARTCARD_OPT_DMA_TX_IT_HT);

  /* In case of TX only mode, if NACK is enabled, the USART must be able to monitor
      the bidirectional line to detect a NACK signal in case of parity error.
      Therefore, the receiver block must be enabled as well (RE bit must be set). */
  if (LL_USART_IsEnabledSmartcardNACK(p_smartcardx) != 0U)
  {
    LL_USART_SetTransferDirection(p_smartcardx, LL_USART_DIRECTION_TX_RX);
  }
  else
  {
    LL_USART_SetTransferDirection(p_smartcardx, LL_USART_DIRECTION_TX);
  }

  LL_USART_Enable(p_smartcardx);

  /* Perform a TX/RX FIFO Flush */
  SMARTCARD_FLUSH_DRREGISTER(hsmartcard);

  hsmartcard->hdma_tx->p_xfer_cplt_cb = SMARTCARD_DMATransmitCplt;

  hsmartcard->hdma_tx->p_xfer_halfcplt_cb = SMARTCARD_DMATxHalfCplt;

  hsmartcard->hdma_tx->p_xfer_error_cb = SMARTCARD_DMAError;

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hsmartcard->hdma_tx, (uint32_t)hsmartcard->p_tx_buff, (uint32_t)&p_smartcardx->TDR,
                                     size, interrupts_dma) != HAL_OK)
  {
#if defined (USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
    hsmartcard->last_error_codes |= HAL_SMARTCARD_TRANSMIT_ERROR_DMA;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
    hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;
    return HAL_ERROR;
  }

