MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  LL_USART_ClearFlag_TC(p_smartcardx);
  LL_USART_EnableIT_ERROR(p_smartcardx);
  LL_USART_EnableDMAReq_TX(p_smartcardx);

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
  if (((interrupts & HAL_SMARTCARD_OPT_TX_IT_FIFO_EMPTY) == HAL_SMARTCARD_OPT_TX_IT_FIFO_EMPTY))
  {
    LL_USART_EnableIT_TXFE(p_smartcardx);
  }
#endif /* USE_HAL_SMARTCARD_FIFO */

  return HAL_OK;
}

/**
  * @brief  Start Receive operation in DMA mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  * @param  p_data Pointer to data buffer (u8 or u16 data elements).
  * @param  size Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL SMARTCARD API providing reception in DMA mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  *         SMARTCARD Handle is assumed as Locked.
  * @retval HAL_OK Receive started in DMA mode.
  * @retval HAL_ERROR DMA did not start.
  */
hal_status_t SMARTCARD_Start_Receive_DMA(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data,
                                         uint32_t size, uint32_t interrupts)
{
  USART_TypeDef *p_smartcardx;
  uint32_t interrupts_dma;

  p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  LL_USART_EnableDirectionRx(p_smartcardx);

  LL_USART_Enable(p_smartcardx);

  hsmartcard->p_rx_buff = p_data;
  hsmartcard->rx_xfer_size = size;
#if defined (USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
  hsmartcard->last_error_codes = HAL_SMARTCARD_ERROR_NONE;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
  interrupts_dma = (interrupts & HAL_SMARTCARD_OPT_DMA_RX_IT_HT);

  hsmartcard->hdma_rx->p_xfer_cplt_cb = SMARTCARD_DMAReceiveCplt;

  hsmartcard->hdma_rx->p_xfer_halfcplt_cb = SMARTCARD_DMARxHalfCplt;

  hsmartcard->hdma_rx->p_xfer_error_cb = SMARTCARD_DMAError;

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hsmartcard->hdma_rx, (uint32_t)&p_smartcardx->RDR,
                                     (uint32_t)hsmartcard->p_rx_buff, size, interrupts_dma) != HAL_OK)
  {
#if defined (USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
    hsmartcard->last_error_codes |= HAL_SMARTCARD_RECEIVE_ERROR_DMA;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
    hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;
    return HAL_ERROR;
  }

  LL_USART_EnableIT_PE(p_smartcardx);
  LL_USART_EnableIT_ERROR(p_smartcardx);
  LL_USART_EnableDMAReq_RX(p_smartcardx);

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
  if (((interrupts & HAL_SMARTCARD_OPT_RX_IT_FIFO_FULL) == HAL_SMARTCARD_OPT_RX_IT_FIFO_FULL))
  {
    LL_USART_EnableIT_RXFF(p_smartcardx);
  }
#endif /* USE_HAL_SMARTCARD_FIFO */
  return HAL_OK;
}
#endif /* USE_HAL_SMARTCARD_DMA */

/**
  * @brief  End ongoing Tx transfer on SMARTCARD peripheral (following error detection or Transmit completion).
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  */
static void SMARTCARD_EndTxTransfer(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  /* Disable TXEIE, TCIE and ERR (Frame error, noise error, overrun error) interrupts */
  LL_USART_DisableIT_CR1(p_smartcardx, (USART_CR1_TXEIE_TXFNFIE | USART_CR1_TCIE));
  LL_USART_DisableIT_ERROR(p_smartcardx);

  LL_USART_DisableDMAReq_TX(p_smartcardx);

  hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;
}

/**
  * @brief  End ongoing Rx transfer on SMARTCARD peripheral (following error detection or Reception completion).
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  */
static void SMARTCARD_EndRxTransfer(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
  LL_USART_DisableIT_CR1(p_smartcardx, (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE));
  LL_USART_DisableIT_ERROR(p_smartcardx);

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
  /* if Rx FIFO full Optional IT have been activated, clear status */
  LL_USART_DisableIT_RXFT(p_smartcardx);
  if (LL_USART_IsEnabledIT_RXFF(p_smartcardx) != 0U)
  {
    LL_USART_DisableIT_RXFF(p_smartcardx);
  }
#endif /* USE_HAL_SMARTCARD_FIFO */

  LL_USART_DisableDMAReq_RX(p_smartcardx);


  hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;
}

#if defined(USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
/**
  * @brief DMA SMARTCARD receive process half complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void SMARTCARD_DMATxHalfCplt(hal_dma_handle_t *hdma)
{
  hal_smartcard_handle_t *hsmartcard = (hal_smartcard_handle_t *)(hdma->p_parent);

#if defined(USE_HAL_SMARTCARD_REGISTER_CALLBACKS) && (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  hsmartcard->p_rx_half_cplt_callback(hsmartcard);
#else
  HAL_SMARTCARD_RxHalfCpltCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SMARTCARD transmit process complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void SMARTCARD_DMATransmitCplt(hal_dma_handle_t *hdma)
{
  hal_smartcard_handle_t *hsmartcard = (hal_smartcard_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  hsmartcard->tx_xfer_count = 0U;

  /* Disable the DMA transfer for transmit request by resetting the DMAT bit
  in the SMARTCARD associated USART CR3 register */
  LL_USART_DisableDMAReq_TX(p_smartcardx);

  /* Enable the SMARTCARD Transmit Complete Interrupt */
  if (hsmartcard->tx_cplt_indication != HAL_SMARTCARD_TX_CPLT_AFTER_GUARD_TIME)
  {
    LL_USART_EnableIT_TCBGT(p_smartcardx);
  }
  else
  {
    LL_USART_EnableIT_TC(p_smartcardx);
  }
}

/**
  * @brief DMA SMARTCARD receive process half complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void SMARTCARD_DMARxHalfCplt(hal_dma_handle_t *hdma)
{
  hal_smartcard_handle_t *hsmartcard = (hal_smartcard_handle_t *)(hdma->p_parent);

#if defined(USE_HAL_SMARTCARD_REGISTER_CALLBACKS) && (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  hsmartcard->p_rx_half_cplt_callback(hsmartcard);
#else
  HAL_SMARTCARD_RxHalfCpltCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SMARTCARD receive process complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void SMARTCARD_DMAReceiveCplt(hal_dma_handle_t *hdma)
{
  hal_smartcard_handle_t *hsmartcard = (hal_smartcard_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

