MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  hsmartcard->rx_xfer_count = 0U;

  /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
  LL_USART_DisableIT_PE(p_smartcardx);
  LL_USART_DisableIT_ERROR(p_smartcardx);

  /* Disable the DMA transfer for the receiver request by resetting the DMAR bit
     in the SMARTCARD associated USART CR3 register */
  LL_USART_DisableDMAReq_RX(p_smartcardx);

  hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  hsmartcard->p_rx_cplt_callback(hsmartcard);
#else
  HAL_SMARTCARD_RxCpltCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SMARTCARD communication error callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void SMARTCARD_DMAError(hal_dma_handle_t *hdma)
{
  hal_smartcard_handle_t *hsmartcard = (hal_smartcard_handle_t *)(hdma->p_parent);
  /* Stop SMARTCARD DMA Tx request if ongoing */
  if (hsmartcard->global_state == HAL_SMARTCARD_STATE_TX_ACTIVE)
  {
    hsmartcard->tx_xfer_count = 0U;
#if defined(USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
    hsmartcard->last_error_codes |= HAL_SMARTCARD_TRANSMIT_ERROR_DMA;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
    SMARTCARD_EndTxTransfer(hsmartcard);
  }

  /* Stop SMARTCARD DMA Rx request if ongoing */
  if (hsmartcard->global_state == HAL_SMARTCARD_STATE_RX_ACTIVE)
  {
    hsmartcard->rx_xfer_count = 0U;
#if defined(USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
    hsmartcard->last_error_codes |= HAL_SMARTCARD_RECEIVE_ERROR_DMA;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
    SMARTCARD_EndRxTransfer(hsmartcard);
  }
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  hsmartcard->p_error_callback(hsmartcard);
#else
  HAL_SMARTCARD_ErrorCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SMARTCARD communication abort callback, when initiated by HAL services on Error
  *         (To be called at end of DMA Abort procedure following error occurrence).
  * @param  hdma DMA handle.
  */
static void SMARTCARD_DMAAbortOnError(hal_dma_handle_t *hdma)
{
  hal_smartcard_handle_t *hsmartcard = (hal_smartcard_handle_t *)(hdma->p_parent);
  hsmartcard->tx_xfer_count = 0U;
  hsmartcard->rx_xfer_count = 0U;

#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  hsmartcard->p_error_callback(hsmartcard);
#else
  HAL_SMARTCARD_ErrorCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
}
#endif /* USE_HAL_SMARTCARD_DMA */

/**
  * @brief  Send an amount of data in non-blocking mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_SMARTCARD_Transmit_IT()
  *         and when the FIFO mode is disabled.
  */
static void SMARTCARD_TxISR(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  /* Check that a Tx process is ongoing */
  if (hsmartcard->global_state == HAL_SMARTCARD_STATE_TX_ACTIVE)
  {
    if (hsmartcard->tx_xfer_count == 0U)
    {
      LL_USART_DisableIT_TXE_TXFNF(p_smartcardx);

      /* Enable the SMARTCARD Transmit Complete Interrupt */
      if (hsmartcard->tx_cplt_indication != HAL_SMARTCARD_TX_CPLT_AFTER_GUARD_TIME)
      {
        LL_USART_EnableIT_TCBGT(p_smartcardx);
      }
      else
      {
        LL_USART_EnableIT_TC(p_smartcardx);
      }
    }
    else
    {
      LL_USART_TransmitData8(p_smartcardx, (uint8_t)(*hsmartcard->p_tx_buff & 0xFFU));
      hsmartcard->p_tx_buff++;
      hsmartcard->tx_xfer_count--;
    }
  }
}

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
/**
  * @brief  Send an amount of data in non-blocking mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_SMARTCARD_Transmit_IT()
  *         and when the FIFO mode is enabled.
  */
static void SMARTCARD_TxISR_FIFOEN(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  uint16_t nb_tx_data;

  /* Check that a Tx process is ongoing */
  if (hsmartcard->global_state == HAL_SMARTCARD_STATE_TX_ACTIVE)
  {
    for (nb_tx_data = hsmartcard->nb_tx_data_to_process ; nb_tx_data > 0U ; nb_tx_data--)
    {
      if (hsmartcard->tx_xfer_count == 0U)
      {
        LL_USART_DisableIT_TXE_TXFNF(p_smartcardx);
        LL_USART_DisableIT_TXFT(p_smartcardx);

        /* Enable the SMARTCARD Transmit Complete Interrupt */
        if (hsmartcard->tx_cplt_indication != HAL_SMARTCARD_TX_CPLT_AFTER_GUARD_TIME)
        {
          LL_USART_EnableIT_TCBGT(p_smartcardx);
        }
        else
        {
          LL_USART_EnableIT_TC(p_smartcardx);
        }
      }
      else if (LL_USART_IsActiveFlag_TXE_TXFNF(p_smartcardx) != 0U)
      {
        LL_USART_TransmitData8(p_smartcardx, (uint8_t)(*hsmartcard->p_tx_buff & 0xFFU));
        hsmartcard->p_tx_buff++;
        hsmartcard->tx_xfer_count--;
      }
      else
      {
        /* Nothing to do */
      }
    }
  }
}

#endif /* USE_HAL_SMARTCARD_FIFO */

/**
  * @brief  Wrap up transmission in non-blocking mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  */
static void SMARTCARD_EndTransmit_IT(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  uint32_t nack_enabled = LL_USART_IsEnabledSmartcardNACK(p_smartcardx);
  /* Disable the SMARTCARD Transmit Complete Interrupt */
  if (hsmartcard->tx_cplt_indication != HAL_SMARTCARD_TX_CPLT_AFTER_GUARD_TIME)
  {
    LL_USART_DisableIT_TCBGT(p_smartcardx);
  }
  else
  {
    LL_USART_DisableIT_TC(p_smartcardx);
  }

