MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
  /* if Tx FIFO empty or Rx FIFO Full Optional IT have been activated, clear status */
  if (LL_USART_IsEnabledIT_TXFE(p_smartcardx) != 0U)
  {
    LL_USART_DisableIT_TXFE(p_smartcardx);
    LL_USART_ClearFlag_TXFE(p_smartcardx);
  }
  if (LL_USART_IsEnabledIT_RXFF(p_smartcardx) != 0U)
  {
    LL_USART_DisableIT_RXFF(p_smartcardx);
  }
#endif /* USE_HAL_SMARTCARD_FIFO */

  /* Disable the Peripheral first to update mode */
  if ((hsmartcard->global_state == HAL_SMARTCARD_STATE_TX_ACTIVE)
      && (nack_enabled != 0U))
  {
    /* In case of NACK enabled, USART is disabled to empty RDR register */
    LL_USART_Disable(p_smartcardx);
    LL_USART_Enable(p_smartcardx);

    /* In case of TX only mode, if NACK is enabled, receiver block has been enabled
       for Transmit phase. Disable this receiver block. */
    LL_USART_DisableDirectionRx(p_smartcardx);

    /* Perform a TX FIFO Flush at end of Tx phase, as all sent bytes are appearing in Rx Data register */
    SMARTCARD_FLUSH_DRREGISTER(hsmartcard);
  }

  hsmartcard->p_tx_isr = NULL;

  hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  hsmartcard->p_tx_cplt_callback(hsmartcard);
#else
  HAL_SMARTCARD_TxCpltCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
}

#if defined(USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
/**
  * @brief  DMA SMARTCARD Tx communication abort callback, when initiated by user
  *         (To be called at end of DMA Tx Abort procedure following user abort request).
  * @param  hdma DMA handle.
  * @note   When this callback is executed, User Abort complete call back is called only if no
  *         Abort still ongoing for Rx DMA Handle.
  */
static void SMARTCARD_DMATxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_smartcard_handle_t *hsmartcard = (hal_smartcard_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  /* Check if an Abort process is still ongoing */
  if (hsmartcard->hdma_rx != NULL)
  {
    if (hsmartcard->hdma_rx->global_state == HAL_DMA_STATE_ABORT)
    {
      return;
    }
  }

  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  hsmartcard->tx_xfer_count = 0U;

  /* Clear the Error flags in the ICR register */
  LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF
                     | LL_USART_ICR_FECF | LL_USART_ICR_RTOCF | LL_USART_ICR_EOBCF);

  hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  hsmartcard->p_abort_cplt_callback(hsmartcard);
#else
  HAL_SMARTCARD_AbortCpltCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SMARTCARD Rx communication abort callback, when initiated by user
  *         (To be called at end of DMA Rx Abort procedure following user abort request).
  * @param  hdma DMA handle.
  * @note   When this callback is executed, User Abort complete call back is called only if no
  *         Abort still ongoing for Tx DMA Handle.
  */
static void SMARTCARD_DMARxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_smartcard_handle_t *hsmartcard = (hal_smartcard_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);

  /* Check if an Abort process is still ongoing */
  if (hsmartcard->hdma_tx != NULL)
  {
    if (hsmartcard->hdma_tx->global_state == HAL_DMA_STATE_ABORT)
    {
      return;
    }
  }

  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  hsmartcard->rx_xfer_count = 0U;

  /* Clear the Error flags in the ICR register */
  LL_USART_ClearFlag(p_smartcardx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF
                     | LL_USART_ICR_FECF | LL_USART_ICR_RTOCF | LL_USART_ICR_EOBCF);

  hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  hsmartcard->p_abort_cplt_callback(hsmartcard);
#else
  HAL_SMARTCARD_AbortCpltCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
}
#endif /* USE_HAL_SMARTCARD_DMA */

/**
  * @brief  Receive an amount of data in non-blocking mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_SMARTCARD_Receive_IT()
  *         and when the FIFO mode is disabled.
  */
static void SMARTCARD_RxISR(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  /* Check that a Rx process is ongoing */
  if (hsmartcard->global_state == HAL_SMARTCARD_STATE_RX_ACTIVE)
  {
    *hsmartcard->p_rx_buff = LL_USART_ReceiveData8(p_smartcardx);
    hsmartcard->p_rx_buff++;

    hsmartcard->rx_xfer_count--;
    if (hsmartcard->rx_xfer_count == 0U)
    {
      LL_USART_DisableIT_RXNE_RXFNE(p_smartcardx);

      /* Check if a transmit process is ongoing or not. If not disable ERR IT */
      if (hsmartcard->global_state == HAL_SMARTCARD_STATE_IDLE)
      {
        LL_USART_DisableIT_ERROR(p_smartcardx);
      }

      LL_USART_DisableIT_PE(p_smartcardx);

      hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

      /* Clear RxISR function pointer */
      hsmartcard->p_rx_isr = NULL;

#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
      hsmartcard->p_rx_cplt_callback(hsmartcard);
#else
      HAL_SMARTCARD_RxCpltCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
    }
  }
  else
  {
    LL_USART_RequestRxDataFlush(p_smartcardx);
  }
}

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
/**
  * @brief  Receive an amount of data in non-blocking mode.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure that contains
  *                    the configuration information for the specified SMARTCARD module.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_SMARTCARD_Receive_IT()
  *         and when the FIFO mode is enabled.
  */
static void SMARTCARD_RxISR_FIFOEN(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  uint16_t nb_rx_data;
  uint32_t rxdatacount;

