MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.c
  /* Check that a Rx process is ongoing */
  if (hsmartcard->global_state == HAL_SMARTCARD_STATE_RX_ACTIVE)
  {
    for (nb_rx_data = hsmartcard->nb_rx_data_to_process ; nb_rx_data > 0U ; nb_rx_data--)
    {
      *hsmartcard->p_rx_buff = LL_USART_ReceiveData8(p_smartcardx);
      hsmartcard->p_rx_buff++;

      hsmartcard->rx_xfer_count--;
      if (hsmartcard->rx_xfer_count == 0U)
      {
        LL_USART_DisableIT_CR1(p_smartcardx, USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE);
        LL_USART_DisableIT_RXFT(p_smartcardx);

        /* Check if a transmit process is ongoing or not. If not disable ERR IT */
        if (hsmartcard->global_state == HAL_SMARTCARD_STATE_IDLE)
        {
          LL_USART_DisableIT_ERROR(p_smartcardx);
        }

        hsmartcard->global_state = HAL_SMARTCARD_STATE_IDLE;

        /* Clear RxISR function pointer */
        hsmartcard->p_rx_isr = NULL;

#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
        hsmartcard->p_rx_cplt_callback(hsmartcard);
#else
        HAL_SMARTCARD_RxCpltCallback(hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
      }
    }

    /* When remaining number of bytes to receive is less than the RX FIFO
    threshold, next incoming frames are processed as if FIFO mode was
    disabled (i.e. one interrupt per received frame).
    */
    rxdatacount = hsmartcard->rx_xfer_count;
    if (((rxdatacount != 0U)) && (rxdatacount < hsmartcard->nb_rx_data_to_process))
    {
      LL_USART_DisableIT_RXFT(p_smartcardx);

      /* Update the RxISR function pointer */
      hsmartcard->p_rx_isr = SMARTCARD_RxISR;

      LL_USART_EnableIT_RXNE_RXFNE(p_smartcardx);
    }
  }
  else
  {
    LL_USART_RequestRxDataFlush(p_smartcardx);
  }
}
#endif /* USE_HAL_SMARTCARD_FIFO */

/** @brief  Flush the SMARTCARD Data registers.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the USART instance.
  */
static void SMARTCARD_FLUSH_DRREGISTER(hal_smartcard_handle_t *hsmartcard)
{
  USART_TypeDef *p_smartcardx = SMARTCARD_GET_INSTANCE(hsmartcard);
  do
  {
    LL_USART_SetRequest(p_smartcardx, LL_USART_REQUEST_RX_DATA_FLUSH);
    LL_USART_SetRequest(p_smartcardx, LL_USART_REQUEST_TX_DATA_FLUSH);
  } while (0U);
}

#if defined(USE_HAL_SMARTCARD_CLK_ENABLE_MODEL) && (USE_HAL_SMARTCARD_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
/** @brief  Set the SMARTCARD clock frequency.
  * @param  hsmartcard Pointer to a \ref hal_smartcard_handle_t structure which contains the SMARTCARD instance.
  */
static void SMARTCARD_EnableClock(const hal_smartcard_handle_t *hsmartcard)
{
  /*! Instance USART1 */
  if (hsmartcard->instance == HAL_SMARTCARD1)
  {
    HAL_RCC_USART1_EnableClock();
  }
  /*! Instance USART2 */
  if (hsmartcard->instance == HAL_SMARTCARD2)
  {
    HAL_RCC_USART2_EnableClock();
  }
#if defined(USART3)
  /*! Instance USART3 */
  if (hsmartcard->instance == HAL_SMARTCARD3)
  {
    HAL_RCC_USART3_EnableClock();
  }
#endif /* USART3 */
#if defined(USART6)
  /*! Instance USART6 */
  if (hsmartcard->instance == HAL_SMARTCARD6)
  {
    HAL_RCC_USART6_EnableClock();
  }
#endif /* USART6 */
}
#endif /* USE_HAL_SMARTCARD_CLK_ENABLE_MODEL */

#if defined(USE_ASSERT_DBG_PARAM)
/**
  * @brief Calculate and check baudrate validity.
  * @param instance_clock_freq Clock frequency of the uart instance used
  * @param instance_clock_prescaler Clock prescaler of the uart instance used
  * @param baud_rate Baud rate to be tested
  * @retval HAL_OK baudrate value is valid
  * @retval HAL_ERROR baudrate value is invalid
  */
hal_status_t SMARTCARD_Check_uart_baudrate_validity(uint32_t instance_clock_freq, uint32_t instance_clock_prescaler,
                                                    uint32_t baud_rate)
{
  uint32_t div_temp;
  div_temp = LL_USART_DIV_SAMPLING16(instance_clock_freq, instance_clock_prescaler, baud_rate);
  if ((div_temp >= USART_BRR_MIN) && (div_temp <= USART_BRR_MAX))
  {
    return HAL_OK;
  }
  return HAL_ERROR;
}
#endif /* USE_ASSERT_DBG_PARAM */

/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_HAL_SMARTCARD_MODULE */
#endif /* USART1 || USART2 || USART3 || UART4 || UART5 || USART6 || UART7 */
/**
  * @}
  */
